import { PrismaClient } from "@prisma/client";
import bcrypt from "bcryptjs";

const prisma = new PrismaClient();

async function main() {
  // ✅ สร้าง Role ต่างๆ
  const roles = [
    { name: "admin" },
    { name: "reviewer" },
    { name: "reviewer_สำนักงานคณบดี" },
    { name: "reviewer_งานบุคลากร" },
    { name: "reviewer_ฝ่ายพัฒนานักศึกษา" },
    { name: "reviewer_ฝ่ายวิชาการ" },
    { name: "reviewer_ฝ่ายวิจัยพัฒนาและบริการวิชาการ" },
    { name: "reviewer_งานประกันคุณภาพการศึกษา" },
    { name: "reviewer_ภาควิชาวิศวกรรมโยธา" },
    { name: "reviewer_ภาควิชาวิศวกรรมเคมี" },
    { name: "reviewer_ภาควิชาวิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม" },
    { name: "reviewer_ภาควิชาวิศวกรรมวัสดุและโลหการ" },
    { name: "reviewer_ภาควิชาวิศวกรรมคอมพิวเตอร์" },
    { name: "reviewer_ภาควิชาวิศวกรรมเครื่องกล" },
    { name: "reviewer_ภาควิชาวิศวกรรมไฟฟ้า" },
    { name: "reviewer_ภาควิชาวิศวกรรมอุตสาหการ" },
    { name: "reviewer_ภาควิชาวิศวกรรมสิ่งทอ" },
    { name: "reviewer_งานแผนและงบประมาณ" },
    { name: "reviewer_ภาควิชาวิศวกรรมเกษตร" },
    // === ภาค/คณะจาก RMUTT ===
    { name: "ผู้ใช้ทั่วไป" },
    { name: "สำนักงานคณบดี" },
    { name: "งานบุคลากร" },
    { name: "ฝ่ายพัฒนานักศึกษา" },
    { name: "ฝ่ายวิชาการ" },
    { name: "ฝ่ายวิจัยพัฒนาและบริการวิชาการ" },
    { name: "งานประกันคุณภาพการศึกษา" },
    { name: "ภาควิชาวิศวกรรมโยธา" },
    { name: "ภาควิชาวิศวกรรมเคมี" },
    { name: "ภาควิชาวิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม" },
    { name: "ภาควิชาวิศวกรรมวัสดุและโลหการ" },
    { name: "ภาควิชาวิศวกรรมคอมพิวเตอร์" },
    { name: "ภาควิชาวิศวกรรมเครื่องกล" },
    { name: "ภาควิชาวิศวกรรมไฟฟ้า" },
    { name: "ภาควิชาวิศวกรรมอุตสาหการ" },
    { name: "ภาควิชาวิศวกรรมสิ่งทอ" },
    { name: "ภาควิชาวิศวกรรมเกษตร" },
    { name: "งานแผนและงบประมาณ" },
  ];

  await Promise.all(
    roles.map(role =>
      prisma.role.upsert({
        where: { name: role.name },
        update: {},
        create: role,
      })
    )
  );

  // ✅ สร้าง Users ตัวอย่าง
  const adminUser = await prisma.user.upsert({
    where: { email: "admin@example.com" },
    update: {},
    create: {
      name: "Admin",
      email: "admin@example.com",
      password: await bcrypt.hash("admin123", 10),
      role: { connect: { name: "admin" } },
    },
  });

  const userA = await prisma.user.upsert({
    where: { email: "test@test.com" },
    update: {},
    create: {
      name: "testA",
      email: "test@test.com",
      password: await bcrypt.hash("testtest", 10),
      role: { connect: { name: "ผู้ใช้ทั่วไป" } },
    },
  });

  const reviewer1 = await prisma.user.upsert({
    where: { email: "reviewer1@test.com" },
    update: {},
    create: {
      name: "Reviewer1",
      email: "reviewer1@test.com",
      password: await bcrypt.hash("reviewer123", 10),
      role: { connect: { name: "reviewer" } },
    },
  });

  // ✅ สร้างฟอร์มตัวอย่าง
  const forms = [
    // {
    //   file: "KR1",
    //   description: "แบบฟอร์มกรอกข้อมูลพื้นฐาน เช่น ชื่อ อายุ",
    //   questions: JSON.stringify([
    //     { id: "q1", label: "What is your name?", type: "text" },
    //     { id: "q2", label: "How old are you?", type: "number" },
    //   ]),
    // },
    // {
    //   file: "KR2",
    //   description: "แบบฟอร์มสำรวจความคิดเห็นเกี่ยวกับโปรแกรมมิ่ง",
    //   questions: JSON.stringify([
    //     { id: "q1", label: "What is your favorite color?", type: "text" },
    //     {
    //       id: "q2",
    //       label: "Do you like coding?",
    //       type: "radio",
    //       options: ["Yes", "No"],
    //     },
    //   ]),
    // },
    {
      file: "RT KR 2.1",
      description: "มูลค่าผลกระทบต่อเศรษฐกิจ สังคม และคุณภาพชีวิต ที่เกิดจากการนำผลงานวิจัยและพัฒนานวัตกรรมไปใช้ประโยชน์",
      method: "ผลงานวิจัย นวัตกรรม ถูกนำไปใช้ประโยชน์อธิบายลักษณะมูลค่าผลกระทบต่อเศรษฐกิจ สังคม และคุณภาพชีวิต อย่างไร ในประเด็น รายได้ ของหน่วยงาน มูลค่าเพิ่มของผู้รับบริการ มูลค่าเพิ่มจากการลงทุน ตามที่นิยาม",
      questions: JSON.stringify([
        { id: "q1", label: "ชื่อผลงานวิจัย สิ่งประดิษฐ์ นวัตกรรมหรืองานสร้างสรรค์ถูกนำไปใช้ประโยชน์", type: "text" },
        { id: "q2", label: "ชื่ออาจารย์/นักวิจัย", type: "text" },
        { id: "q3", label: "ระบุการนำไปใช้ประโยชน์", type: "text" },
        { id: "q4", label: "วันที่ ที่นำไปใช้ประโยชน์", type: "date-range" },
        { id: "q5", label: "ระบุจำนวนเงินที่สร้างผลกระทบต่อเศรษฐกิจ สังคม และคุณภาพชีวิต", type: "text" },
      ]),
    },
    {
      file: "RT KR 2.2",
      description: "ผลงานวิจัย งานสร้างสรรค์ องค์ความรู้ ความเชี่ยวชาญและเทคโนโลยีพร้อมใช้ ถูกนำไปสร้างมูลค่าเชิงพาณิชย์",
      method : "1.ต้องมีหนังสือรับรองการนำไปใช้ประโยชน์หรือสร้างรายได้ที่ออกโดยหน่วยงานภายนอกภาคเอกชน หรือ สัญญาอนุญาตให้ใช้สิทธิ์ในทรัพย์สินทางปัญญาหรือสัญญาอนุญาตให้ผลิตซึ่งผลงานวิจัยจะต้องได้รับ เลขจดทะเบียนทรัพย์สินทางปัญญา",
      questions: JSON.stringify([
        { id: "q1", label: "ผลงานวิจัย งานสร้างสรรค์ องค์ความรู้  ความเชี่ยวชาญ และเทคโนโลยีพร้อมใช้", type: "text" },
        { id: "q2", label: "ชื่ออาจารย์/นักวิจัย", type: "text" },
        { id: "q3", label: "ระบุการนำไปสร้างมูลค่าเชิงพาณิชย์อย่างไร", type: "text" },
        { id: "q4", label: "ระบุ บริษัท/หน่วยงาน/องค์กร ที่นำไปสร้างมูลค่า", type: "text" },
        { id: "q5", label: "วันที่ ที่นำไปสร้างมูลค่าเชิงพาณิชย์", type: "date-range" },
      ]),
    },
    {
      "file": "RT KR 2.3",
      "description": "ผลงานวิจัยที่เผยแพร่ในระดับนานาชาติ พร้อมรายละเอียดการตีพิมพ์",
      "method" : "ผลงานวิจัยและ/หรือผลงานสร้างสรรค์ที่ตีพิมพ์เผยแพร่ในฐานข้อมูลในระดับนานาชาติ SCOPUS ของอาจารย์ประจำและนักวิจัยประจำ ผลงานสร้างสรรค์ที่ตีพิมพ์เผยแพร่ตามปีงบประมาณ (1 ตุลาคม – 30 กันยายน)ของแต่ละปี เพื่อใช้ในการรายงานผลการดำเนินงาน",
      "questions": JSON.stringify([
        { "id": "q1", "label": "ชื่อผลงานวิจัยที่เผยแพร่", "type": "text" },
        { "id": "q2", "label": "ชื่อ-นามสกุล เจ้าของผลงาน", "type": "text" },
        { "id": "q3", "label": "ชื่อวารสารที่เผยแพร่", "type": "text" },
        {
          "id": "q4",
          "label": "(วัน/เดือน/ปีที่ตีพิมพ์, เล่มที่พิมพ์หรือฉบับที่พิมพ์, เลขหน้าที่พิมพ์หน้าแรกถึงหน้าสุดท้าย)",
          "type": "group",
          "children": [
            { "id": "q4_1", "label": "Volume", "type": "text" },
            { "id": "q4_2", "label": "Issue", "type": "text" },
            { "id": "q4_3", "label": "Art. No.", "type": "text" },
            { "id": "q4_4", "label": "Page Start", "type": "text" },
            { "id": "q4_5", "label": "Page End", "type": "text" }
          ]
        },
        { "id": "q5", "label": "ระดับคุณภาพของผลงานที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติ", "type": "text" }
      ]),
    },
    {
      "file": "RT KR 2.4",
      "description": "งบประมาณวิจัยจากหน่วยงานภายนอก (PPP, Industry, Government),",
      "method" : "แหล่งทุนในประเทศ เช่น สวทช. สกว. สกอ. วช. NIA บพข. บพค. และ บพท. แหล่งทุนต่างประเทศ จากหน่วยงานภาคอุตสาหกรรม เอกชน กระทรวง จังหวัด อื่น ๆ ที่ไม่ใช่แหล่งทุนวิจัย",
      "questions": JSON.stringify([
        { "id": "q1", "label": "ชื่อผลงานวิจัย หรือ งานสร้างสรรค์", "type": "text" },
        { "id": "q2", "label": "ชื่อ-นามสกุล เจ้าของผลงาน", "type": "text" },
        {
          "id": "q3",
          "label": "วงเงินที่ได้รับ (บาท)",
          "type": "group",
          "children": [
            { "id": "q3_1", "label": "แหล่งภายนอก", "type": "number" },
            { "id": "q3_2", "label": "Talent Mobility", "type": "number" },
            { "id": "q3_3", "label": "iTAP", "type": "number" }
          ]
        },
        { "id": "q4", "label": "ชื่อหน่วยงานภายนอกที่สนับสนุน", "type": "text" },
        { "id": "q5", "label": "ประเภททุน", "type": "text" },
        { "id": "q6", "label": "วัน/เดือน/ปีที่ได้รับงบประมาณ", "type": "date-range" },
        { "id": "q7", "label": "PMU/ภาครัฐ/ภาคเอกชน", "type": "text" },
        { "id": "q8", "label": "เลขหนังสือ/รหัสสัญญารับทุน", "type": "text" }
      ]),
    },
    {
      "file": "RT KR 3.1.1",
      "description": "ผลสัมฤทธิ์ที่สำคัญ KR 3.1 กำลังคนในภาคประกอบการ/ภาคอุตสาหกรรม/กำลังคนทุกช่วงวัย ที่ได้รับการพัฒนาตามหลักสูตร Re-skill, Up-skill, New-skill หรือมาใช้บริการ",
      "method" : "หนังสือรับรอง/หนังสือเชิญที่ภาคประกอบการ/ภาคอุตสาหกรรมแสดงความต้องการให้มหาวิทยาลัยให้บริการทางวิชาการ และที่ได้รับการอนุมัติจากสภาวิชาการ มทร.ธัญบุรี",
      "questions": JSON.stringify([
        { "id": "q1", "label": "ชื่อหลักสูตร/ชื่อห้อง Lab", "type": "text" },
        { "id": "q2", "label": "ผู้รับผิดชอบ", "type": "text" },
        { "id": "q3", "label": "รายได้ที่ได้รับจากการบริการวิชาการ", "type": "number" },
        { "id": "q4", "label": "ชื่อ-สกุล ผู้ที่ได้รับการพัฒนา", "type": "text" },
        { "id": "q5", "label": "ที่อยู่ที่ทำงานของผู้ที่ได้รับการพัฒนา", "type": "text" },
        { "id": "q6", "label": "วัน/เดือน/ปี (ประชุม, อบรม, ใช้ห้อง Lab, ให้คำปรึกษา)", "type": "date-range" },
        { "id": "q7", "label": "ผู้ที่ได้รับการพัฒนาได้รับประโยชน์จากหลักสูตรอบรมอย่างไร (โปรดอธิบาย)", "type": "text" },
        { "id": "q8", "label": "หมายเหตุ", "type": "text" }
      ]),
    },
    {
      "file": "RT KR 3.1.2",
      "description": "ผลสัมฤทธิ์ที่สำคัญ KR 3.1 กำลังคนในภาคประกอบการ/ภาคอุตสาหกรรม/กำลังคนทุกช่วงวัย ที่ได้รับการพัฒนาตามหลักสูตร Re-skill, Up-skill, New-skill หรือมาใช้บริการ",
      "method" : "หนังสือรับรอง/หนังสือเชิญที่ภาคประกอบการ/ภาคอุตสาหกรรมแสดงความต้องการให้มหาวิทยาลัยให้บริการทางวิชาการ และที่ได้รับการอนุมัติจากสภาวิชาการ มทร.ธัญบุรี",
      "questions": JSON.stringify([
        { "id": "q1", "label": "ชื่อหลักสูตร/ชื่อห้อง Lab", "type": "text" },
        { "id": "q2", "label": "ผู้รับผิดชอบ", "type": "text" },
        { "id": "q3", "label": "ชื่อ-สกุล ผู้ที่ได้รับการพัฒนา", "type": "text" },
        { "id": "q4", "label": "ที่อยู่ที่ทำงานของผู้ที่ได้รับการพัฒนา", "type": "text" },
        { "id": "q5", "label": "วัน/เดือน/ปี ที่ดำเนินการ (ประชุม, อบรม, ใช้ห้อง Lab, ให้คำปรึกษา)", "type": "date-range" },
        { "id": "q6", "label": "ผู้เข้าร่วมอบรมได้รับประโยชน์จากหลักสูตรอย่างไร (โปรดอธิบาย)", "type": "text" },
        { "id": "q7", "label": "หมายเหตุ", "type": "text" }
      ]),
    },{
      "file": "RT KR 3.2",
      "description": "ผลิตภัณฑ์ (สินค้าหรือบริการ) ในชุมชน/พื้นที่/หน่วยงานที่ได้รับการรับรองมาตรฐาน สร้างรายได้ หรือสร้างมูลค่าเพิ่ม จากงานบริการวิชาการ หรือ การขับเคลื่อนเศรษฐกิจสร้างสรรค์บนฐานศิลปวัฒนธรรมและภูมิปัญญาท้องถิ่น",
      "method" : "ต้องมีเอกสารรับรองมาตรฐานจากหน่วยงานที่ออกให้ทั้งภาครัฐและเอกชน MOU/TOR/หนังสือเชิญ/หนังสือรับรองการเข้าไปบริการ/หนังสือแจ้งเจตจำนงในการขอรับบริการ/สัญญา หรือข้อตกลงเป็นลายลักษณ์อักษร ซึ่งเป็นผลการดำเนินงานย้อนหลัง 1 ปี หรือเป็นผลการดำเนินงานที่ดำเนินการเรียบร้อยแล้วในปีงบประมาณนั้น ๆ",
      "questions": JSON.stringify([
        { "id": "q1", "label": "ผลิตภัณฑ์ (สินค้า/บริการ) ของชุมชนที่ได้รับรองมาตรฐาน สร้างรายได้ หรือสร้างมูลค่าเพิ่ม", "type": "text" },
        { "id": "q2", "label": "ระบุชื่อชุมชน/พื้นที่ที่เป็นเจ้าของผลิตภัณฑ์ (สินค้า/บริการ)", "type": "text" },
    
        {
          "id": "q3",
          "label": "ผลิตภัณฑ์ (สินค้าหรือบริการ) ในชุมชน/พื้นที่/หน่วยงานที่ได้รับการรับรองมาตรฐานสร้างรายได้",
          "type": "group",
          "children": [
            {
              "id": "q3_1",
              "label": "ระบุ มาตรฐานที่ได้รับการรับรอง และวัน/เดือน/ปี ที่ได้รับการจดขึ้นทะเบียน",
              "type": "date-range"
            },
            {
              "id": "q3_2",
              "label": "อธิบายผลลัพธ์/ผลกระทบ ที่สามารถวัดได้ในเชิงเศรษฐกิจ (สร้างรายได้ / มูลค่าเพิ่ม)",
              "type": "text"
            },
            {
              "id": "q3_3",
              "label": "ประเภทงาน",
              "type": "radio",
              "options": [
                "งานบริการวิชาการ",
                "ศิลปวัฒนธรรมและภูมิปัญญาท้องถิ่น"
              ]
            }
          ]
        },
        {
          "id": "q4",
          "label": "การดำเนินงานส่งเสริม พัฒนาของหน่วยงาน",
          "type": "group",
          "children": [
            { "id": "q4_1", "label": "ชื่อโครงการ/กิจกรรม", "type": "text" },
            { "id": "q4_2", "label": "วัน/เดือน/ปี ที่จัดโครงการ/กิจกรรม", "type": "date-range" },
            { "id": "q4_3", "label": "ผู้รับผิดชอบ", "type": "text" }
          ]
        }
      ]),
    },
    {
      "file": "RT KR 3.3",
      "description": "รายได้จากการบริการวิชาการ",
      "method" : "1.บริการวิเคราะห์, ทดสอบ, ตรวจสอบและตรวจซ่อม\n2.บริการเครื่องมือและอุปกรณ์ต่าง ๆ ทางการศึกษา\n3.บริการจัดฝึกอบรม\n4.สัมมนาและประชุมเชิงปฏิบัติการแบบเก็บค่าลงทะเบียน บริการจัดฝึกอบรม\n5.สัมมนาและประชุมเชิงปฏิบัติการในลักษณะการว่าจ้าง\n6.บริการเกี่ยวกับสุขภาพที่นอกเหนือจากหน้าที่ความรับผิดชอบโดยตรงของหน่วยงานที่เกี่ยวข้อง\n7.บริการศึกษา, วิจัย, สำรวจ, การวางแผนและการจัดการ\n8.บริการศึกษาความเหมาะสมของโครงการ, การศึกษาผลกระทบสิ่งแวดล้อม\n9.บริการวางระบบ, ออกแบบ, สร้าง, ประดิษฐ์และผลิต\n10.งานที่ได้รับงบประมาณจากส่วนราชการอื่น โดยจัดทำสัญญาว่าจ้างระหว่างกันกับหน่วยงานภายนอก, องค์กรภาครัฐ, ภาคเอกชน, สถานประกอบการภาคอุตสาหกรรมหรือชุมชน",
      "questions": JSON.stringify([
        { "id": "q1", "label": "ชื่อโครงการหรือกิจกรรมงานบริการวิชาการที่ให้แก่หน่วยงานภายนอก", "type": "text" },
        { "id": "q2", "label": "ศูนย์ COE / ชื่อ สกุล ผู้รับผิดชอบ", "type": "text" },
        { "id": "q3", "label": "ระบุชื่อหน่วยงานภายนอกที่รับการบริการวิชาการจาก มทร.ธัญบุรี", "type": "text" },
        { "id": "q4", "label": "ลักษณะและขอบเขตของการบริการวิชาการและวิชาชีพที่ก่อให้เกิดรายได้", "type": "text" },
        { "id": "q5", "label": "ระยะเวลาตามสัญญา", "type": "text" },
        { "id": "q6", "label": "งบประมาณตามสัญญา", "type": "text" },

        {
          "id": "q7",
          "label": "การใช้ระเบียบ มทร.ธัญบุรี ว่าด้วยการบริการวิชาการในการเบิกจ่าย",
          "type": "radio",
          "options": ["ใช้", "ไม่ใช้"]
        },
        {
          "id": "q8",
          "label": "รายรับจากบริการในปีที่ประเมิน",
          "type": "group",
          "children": [
            { "id": "q8_1", "label": "งบประมาณที่ได้รับ", "type": "number" },
            { "id": "q8_2", "label": "วัน/เดือน/ปี ที่ได้รับงบประมาณ", "type": "date-range" }
          ]
        },
    
        {
          "id": "q9",
          "label": "รายจ่าย",
          "type": "group",
          "children": [
            { "id": "q9_1", "label": "งบประมาณดำเนินงาน", "type": "number" }
          ]
        },
    
        {
          "id": "q10",
          "label": "รายได้สุทธิ - จำนวนเงินนำส่ง",
          "type": "group",
          "children": [
            { "id": "q10_1", "label": "หน่วยงาน", "type": "number" },
            { "id": "q10_2", "label": "มหาวิทยาลัย", "type": "number" },
            { "id": "q10_3", "label": "รวมเงินนำส่ง", "type": "number" },
            { "id": "q10_4", "label": "คงเหลือตามสัญญา", "type": "number" }
          ]
        }
      ]),
    },
    {
      "file": "RT KR 3.4",
      "description": "ข้อมูลธุรกิจ Startup ที่เข้ารับการบ่มเพาะและกิจกรรมที่เกี่ยวข้อง",
      "questions": JSON.stringify([
        { "id": "q1", "label": "รายชื่อธุรกิจ Startup ที่เข้ารับการบ่มเพาะ", "type": "text" },
        { "id": "q2", "label": "สถานที่ประกอบธุรกิจ Startup", "type": "text" },
        { "id": "q3", "label": "ชื่อหลักสูตร/โครงการบ่มเพาะผู้ประกอบการ Startup", "type": "text" },
        { "id": "q4", "label": "ผู้รับผิดชอบ", "type": "text" },
        { "id": "q5", "label": "วัน/เดือน/ปี ที่จัดโครงการ/กิจกรรม", "type": "date-range" }
      ]),
    },
    {
      "file": "RT KR 3.4.1",
      "description": "ผลสัมฤทธิ์ที่สำคัญ KR 3.4 ธุรกิจ Startup ที่ได้รับการบ่มเพาะจากมหาวิทยาลัย",
      "questions": JSON.stringify([
        { "id": "q1", "label": "รายชื่อธุรกิจ Startup ที่ได้รับการบ่มเพาะจากมหาวิทยาลัย", "type": "text" },
        { "id": "q2", "label": "วัน/เดือน/ปี ที่เข้ารับการบ่มเพาะ", "type": "date-range" },
        { "id": "q3", "label": "อธิบายการสร้างมูลค่าเพิ่ม หรือมูลค่าเพิ่มจากการลงทุน", "type": "text" }
      ]),
    },
    {
      "file": "RT KR 4.3",
      "description": "รายรับนอกเหนือจากการจัดการศึกษาเป็นไปตามแผน",
      "method" : "1.รายได้จากการวิจัย (งบประมาณภายนอก)\n2.รายได้จากทรัพย์สินทางปัญญา\n3.รายได้จากการฝึกอบรม\n4.รายได้จากการทดสอบสมรรถนะ\n5.รายได้จากการบริการวิชาการ/งานที่ปรึกษา\n6.รายได้จากการบริการสอบเทียบ/ทดสอบ/ผลิตชิ้นงาน/ขายผลิตภัณฑ์/วิเคราะห์/ตรวจสอบ/ตรวจซ่อม \n7.รายได้จากศูนย์ความเป็นเลิศ (COE) \n8.บริการเครื่องมือและอุปกรณ์ต่างๆ \n9.งานที่ได้รับงบประมาณจากส่วนราชการอื่นโดยจัดทำสัญญาว่าจ้างระหว่างกันกับหน่วยงานภายนอก องค์กรภาครัฐ ภาคเอกชน สถานประกอบการภาคอุตสาหกรรม หรือชุมชน",
      "questions": JSON.stringify([
        {
          "id": "q1",
          "label": "ระบุชื่อรายรับนอกเหนือจากการจัดการศึกษา (รายได้จากงานวิจัย รายได้จากบริการทางวิชาการ และรายได้อื่นๆ)",
          "type": "text"
        },
        {
          "id": "q2",
          "label": "รายรับก่อนหักค่าใช้จ่าย",
          "type": "group",
          "children": [
            {
              "id": "q2_1",
              "label": "จำนวนเงิน (บาท)",
              "type": "number"
            },
            {
              "id": "q2_2",
              "label": "วัน/เดือน/ปี ที่ได้รับ",
              "type": "date-range"
            }
          ]
        }
      ])
    },
    {
      "file": "RT KPI 2.6",
      "description": "ความร่วมมือเพื่อพัฒนาผู้ประกอบการและส่งเสริมการสร้างนวัตกรรมกับภาคธุรกิจ/อุตสาหกรรม (University- Industry Linkage) ",
      "method" : "รายงานรายละเอียดความร่วมมือเพื่อพัฒนาผู้ประกอบการและส่งเสริมการสร้างนวัตกรรมกับภาคธุรกิจ/อุตสาหกรรม และกิจกรรมที่เกิดขึ้นตามที่ระบุไว้ในความร่วมมือ ",
      "questions": JSON.stringify([
        { "id": "q1", "label": "หน่วยงานที่มีความร่วมมือ", "type": "text" },
        { "id": "q2", "label": "วัน/เดือน/ปี ที่ลงนามความร่วมมือ", "type": "date-range" },
        { "id": "q3", "label": "รายละเอียดกิจกรรม/โครงการที่ดำเนินการเพื่อพัฒนาผู้ประกอบการและส่งเสริมการสร้างนวัตกรรม", "type": "text" },
        { "id": "q4", "label": "ผู้รับผิดชอบในการดำเนินกิจกรรม/โครงการ", "type": "text" },
        { "id": "q5", "label": "วัน/เดือน/ปี ที่จัดกิจกรรม/โครงการ", "type": "date-range" },
        { "id": "q6", "label": "สถานที่ดำเนินการ", "type": "text" },
        { "id": "q7", "label": "บริษัท/ภาคอุตสาหกรรม", "type": "text" }
      ]),
    },
    {
      "file": "RT KPI 2.5",
      "description": "จำนวนบทความวิจัยที่ได้รับการตีพิมพ์ โดยมีอาจารย์หรือนักวิจัยจากหน่วยงานหรือสถาบันการศึกษาจากต่างประเทศเป็นผู้ร่วมประพันธ์ ",
      "method" : "1.การตีพิมพ์ในวารสารวิชาการ (Journal) ที่มีชื่อปรากฏอยู่ในฐานข้อมูล Thai-journal CitationIndex Centre (TCI) หรือ การตีพิมพ์ในวารสารวิชาการ (Journal) ที่ปรากฏในฐานข้อมูลสากล ได้แก่ ฐานข้อมูลการจัดอันดับวารสาร SJR (SCImago Journal Rank : www.scimagojr.com) หรือฐานข้อมูล Web ofScience (Science CitationIndex Expand, Social Science Citation Index, Art and Humanities CitationIndex) หรือฐานข้อมูล Scopus \n2.บทความวิจัย โดยมีอาจารย์ หรือนักวิจัยจากหน่วยงาน หรือสถาบันการศึกษาจากต่างประเทศเป็นผู้ร่วมประพันธ์ที่ตีพิมพ์เผยแพร่ในฐานข้อมูลระดับนานาชาติ",
      "questions": JSON.stringify([
        { "id": "q1", "label": "ชื่อบทความวิจัย", "type": "text" },
        { "id": "q2", "label": "ชื่อ-นามสกุล เจ้าของผลงาน", "type": "text" },
    
        {
          "id": "q3",
          "label": "อาจารย์หรือนักวิจัยที่ร่วมประพันธ์",
          "type": "group",
          "children": [
            { "id": "q3_1", "label": "ชื่อ-นามสกุล", "type": "text" },
            { "id": "q3_2", "label": "หน่วยงาน / สถาบันการศึกษาจากต่างประเทศที่สังกัด", "type": "text" }
          ]
        },
    
        {
          "id": "q4",
          "label": "ระดับการเผยแพร่",
          "type": "radio",
          "options": ["ระดับชาติ", "ระดับนานาชาติ"]
        },
    
        {
          "id": "q5",
          "label": "รายละเอียดการตีพิมพ์เผยแพร่",
          "type": "group",
          "children": [
            { "id": "q5_1", "label": "ชื่อวารสารที่เผยแพร่", "type": "text" },
            { "id": "q5_2", "label": "วัน/เดือน/ปี ที่ตีพิมพ์", "type": "date-range" },
            { "id": "q5_3", "label": "เล่มที่พิมพ์ / ฉบับที่พิมพ์", "type": "text" },
            { "id": "q5_4", "label": "เลขหน้าแรกถึงหน้าสุดท้าย", "type": "text" },
            { "id": "q5_5", "label": "ระดับคุณภาพของวารสารที่ตีพิมพ์ตามฐานข้อมูล TCI", "type": "text" },
            { "id": "q5_6", "label": "ระดับคุณภาพของวารสารที่ตีพิมพ์ตาม Quartile", "type": "text" }
          ]
        }
      ]),
    },
    {
      "file": "RT KPI 2.4",
      "description": "นักศึกษาระดับบัณฑิตศึกษามีผลงานวิทยานิพนธ์ที่ตีพิมพ์ในฐานข้อมูลนานาชาติ",
      "method" : "นับผลงานที่ตีพิมพ์ในฐานข้อมูลสากล ได้แก่ ฐานข้อมูลการจัดอันดับวารสาร SJR (SCImago JournalRank : www.scimagojr.com) หรือฐานข้อมูล ISI Web of Science (Science CitationIndex Expand,Social Science Citation Index, Art and Humanities Citation Index) หรือฐานข้อมูล Scopus",
      "questions": JSON.stringify([
        { "id": "q1", "label": "ชื่อ-นามสกุล", "type": "text" },
        { "id": "q2", "label": "ปีที่จบการศึกษา", "type": "text" },
        { "id": "q3", "label": "ชื่อวิทยานิพนธ์", "type": "text" },
        {
          "id": "q4",
          "label": "รายละเอียดการเผยแพร่ในระดับนานาชาติ",
          "type": "group",
          "children": [
            { "id": "q4_1", "label": "ชื่อวารสารที่เผยแพร่", "type": "text" },
            {
              "id": "q4_2",
              "label": "วัน/เดือน/ปี ที่ตีพิมพ์, เล่มที่พิมพ์หรือฉบับที่พิมพ์, เลขหน้าที่พิมพ์หน้าแรกถึงหน้าสุดท้าย",
              "type": "date-range"
            }
          ]
        }
      ])
    },
    {
      "file": "RT KPI 2.3",
      "description": "ผลงานวิจัยที่ตีพิมพ์ในกลุ่มวารสารวิชาการระดับนานาชาติที่จัดกลุ่มเป็นวารสารที่มีผลกระทบสูง (Q1)",
      "method" : "1.นับผลงานวิจัยตีพิมพ์ในปีงบประมาณ 2568 เท่านั้น \n2.กรณีที่เป็นผลงานวิจัยของนักศึกษาที่มีชื่ออาจารย์ที่ปรึกษาในการตีพิมพ์บทความ สามารถนับได้ \n3.นับผลงานที่ตีพิมพ์ในฐานข้อมูลสากล ได้แก่ ฐานข้อมูลการจัดอันดับวารสาร SJR (SCImago JournalRank : www.scimagojr.com) หรือฐานข้อมูล ISI Web of Science (Science CitationIndex Expand,Social Science Citation Index, Art and Humanities Citation Index) หรือฐานข้อมูล Scopus",
      "questions": JSON.stringify([
        { "id": "q1", "label": "ชื่อผลงานวิจัยที่เผยแพร่", "type": "text" },
        { "id": "q2", "label": "ชื่อ-นามสกุล เจ้าของผลงาน", "type": "text" },
        { "id": "q3", "label": "ชื่อวารสารที่เผยแพร่", "type": "text" },
        
        {
          "id": "q4",
          "label": "(วัน/เดือน/ปีที่ตีพิมพ์, เล่มที่พิมพ์หรือฉบับที่พิมพ์, เลขหน้าที่พิมพ์หน้าแรกถึงหน้าสุดท้าย)",
          "type": "group",
          "children": [
            { "id": "q4_1", "label": "Volume", "type": "text" },
            { "id": "q4_2", "label": "Issue", "type": "text" },
            { "id": "q4_3", "label": "Art. No.", "type": "text" },
            { "id": "q4_4", "label": "Page start", "type": "text" },
            { "id": "q4_5", "label": "Page end", "type": "text" },
            { "id": "q4_6", "label": "วัน/เดือน/ปี ที่ตีพิมพ์", "type": "date-range" }
          ]
        },
    
        { "id": "q5", "label": "ระดับคุณภาพของผลงานที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติ (Quartile)", "type": "text" }
      ])
    },
    {
      "file": "RT KPI 2.2",
      "description": "สถานประกอบการที่ได้รับการถ่ายโอนองค์ความรู้ เทคโนโลยีหรือนวัตกรรมแล้วก่อให้เกิดมูลค่าเพิ่มลดรายจ่าย เพิ่มรายได้หรือช่วยแก้ปัญหา",
      "method" : "1.มีหลักฐานสถานประกอบการที่ได้รับการถ่ายโอนองค์ความรู้ เทคโนโลยีหรือนวัตกรรมแล้วก่อให้เกิดมูลค่าเพิ่มลดรายจ่ายเพิ่มรายได้หรือช่วยแก้ปัญหา/หลักฐานเชิงประจักษ์อื่น ๆ  \n2.เป็นผลงานที่เกิดจากความเชี่ยวชาญของอาจารย์ สามารถก่อให้เกิดมูลค่าเพิ่มลดรายจ่ายเพิ่มรายได้หรือช่วยแก้ปัญหา ให้กับสถานประกอบการได้ เช่น ผลงานอาจารย์ที่ทำงานกับภาคอุตสาหกรรม ผลงานอาจารย์ที่เป็นที่ผู้เชี่ยวชาญในโปรแกรมการพัฒนาเทคโนโลยีของอุตสาหกรรมไทย เป็นต้น",
      "questions": JSON.stringify([
        { "id": "q1", "label": "สถานประกอบการที่ได้รับการถ่ายทอดองค์ความรู้ เทคโนโลยี หรือ นวัตกรรม", "type": "text" },
        { "id": "q2", "label": "ชื่อผลงานวิจัย งานสร้างสรรค์ที่นำไปถ่ายทอดองค์ความรู้ เทคโนโลยีหรือ นวัตกรรมให้กับสถานประกอบการ", "type": "text" },
        { "id": "q3", "label": "ชื่อ-นามสกุล เจ้าของผลงาน", "type": "text" },
        { "id": "q4", "label": "วัน/เดือน/ปี ที่ถ่ายทอดองค์ความรู้ เทคโนโลยีหรือ นวัตกรรม", "type": "date-range" },
        { "id": "q5", "label": "ระบุว่าได้นำไปใช้ประโยชน์ด้านเทคโนโลยีหรือนวัตกรรม หรือลดรายจ่ายเพิ่มรายได้หรือช่วยแก้ปัญหาอย่างไร", "type": "text" }
      ]),
    },
    {
      "file": "RT KPI 2.1",
      "description": "ผลงานวิจัย สิ่งประดิษฐ์ นวัตกรรมหรืองานสร้างสรรค์ ถูกนำไปใช้ประโยชน์เพื่อเพิ่มขีดความสามารถในการแข่งขัน ตอบโจทย์ท้าทายของประเทศหรือพัฒนาชุมชนให้มีความเข้มแข็งและยั่งยืน ",
      "method" : "1.ชื่อ-นํามสกุลเจ้าของผลงาน สังกัดคณะวิศวกรรมศาสตร์  \n2.หนังสือการรับรองการนำไปใช้ประโยชน์หรือสร้างรายได้ที่ออกโดยหน่วยงานภายนอก/ภาคเอกชน/ชุมชน หรือหนังสือขอบคุณ (อย่างใดอย่างหนึ่ง) หลักฐาน หรือเอกสารแสดงการติดตํามการนำไปใช้ประโยชน์ของชุมชนในด้านต่าง ๆ  \n3.สัญญาอนุญาตให้ใช้สิทธิ์ในทรัพย์สินทางปัญญา หรือสัญญาอนุญาตให้ผลิต ซึ่งผลงํานวิจัยจะต้องได้รับความคุ้มครองทรัพย์สินทางปัญญาเรียบร้อย เช่น ได้รับเลขที่คำขอสิทธิบัตร หรืออนุสิทธิบัตร หรือได้รับเลขจดทะเบียนทรัพย์สินทางปัญญา",
      "questions": JSON.stringify([
        { "id": "q1", "label": "ชื่อผลงานวิจัย สิ่งประดิษฐ์ นวัตกรรม หรือการสร้างสรรค์ที่ถูกนำไปใช้ประโยชน์", "type": "text" },
        { "id": "q2", "label": "ชื่ออาจารย์/นักวิจัย", "type": "text" },
        { "id": "q3", "label": "ประเภทงานวิจัยที่นำไปใช้ประโยชน์", "type": "text" },
        { "id": "q4", "label": "ระบุการนำไปใช้ประโยชน์", "type": "text" },
        { "id": "q5", "label": "วันที่ ที่นำไปใช้ประโยชน์", "type": "date-range" }
      ]),
    },
    {
      "file": "KPI 1.2 คณะ",
      "description": "บัณฑิตที่สอบผ่านมาตรฐานของสภาวิศวกร วิชาชีพผู้ประกอบวิชาชีพวิศวกรรมควบคุม",
      "questions": JSON.stringify([
        { "id": "q1", "label": "รหัสนักศึกษา", "type": "text" },
        { "id": "q2", "label": "ชื่อ - สกุล", "type": "text" },
        { "id": "q3", "label": "ชั้นปี", "type": "text" },
        { "id": "q4", "label": "สาขาวิชา", "type": "text" },
    
        {
          "id": "q5",
          "label": "มาตรฐานสภาวิชาชีพ",
          "type": "group",
          "children": [
            { "id": "q5_1", "label": "มาตรฐาน (ระบุชื่อมาตรฐานที่ได้รับ)", "type": "text" },
            { "id": "q5_2", "label": "หน่วยงานที่ออกใบ Cert.", "type": "text" }
          ]
        },
    
        { "id": "q6", "label": "วัน/เดือน/ปี ที่ผ่านการประเมิน /Certificate", "type": "date-range" },
        {
          "id": "q7",
          "label": "ช่วงเวลารวบรวมข้อมูล (ไตรมาส 1,2,3,4)",
          "type": "radio",
          "options": ["1", "2", "3", "4"]
        }
      ]),
    },
    {
      "file": "KPI 1.1 คณะ",
      "description": "นักศึกษาสามารถสอบสมรรถนะวิชาชีพตามมาตรฐานระดับชาติหรือนานาชาติ",
      "method": "1.นักศึกษาทั้งหมดทุกชั้นปีของคณะ \n2.ไม่นับสมรรถนะท้ายเล่มหลักสูตร \n3.สอบผ่านมากกกว่า 1 มาตรฐาน สามารถนับซ้ำได้",
      "questions": JSON.stringify([
        { "id": "q1", "label": "ชื่อ-นามสกุล", "type": "text" },
        { "id": "q2", "label": "ชั้นปี", "type": "text" },
        { "id": "q3", "label": "ภาควิชา/สาขาวิชา", "type": "text" },
    
        {
          "id": "q4",
          "label": "นักศึกษามีผลสอบสมรรถนะจากหน่วยงานภายนอก",
          "type": "group",
          "children": [
            { "id": "q4_1", "label": "ระบุ - มาตรฐานคุณวุฒิวิชาชีพ/สถาบันคุณวุฒิวิชาชีพ", "type": "text" },
            { "id": "q4_2", "label": "สถานที่/หน่วยงานที่จัด", "type": "text" },
            { "id": "q4_3", "label": "ผลการสอบ/คะแนน (คะแนนที่ได้หรือระดับคะแนนเต็ม)", "type": "text" },
            { "id": "q4_4", "label": "วัน/เดือน/ปี(พ.ศ.) ที่ผ่านการประเมิน /Certificate", "type": "date-range" },
            { "id": "q4_5", "label": "ระดับมาตรฐานหน่วยงานออกใบรับรอง (ชาติ/นานาชาติ)", "type": "text" }
          ]
        },
        {
          "id": "q5",
          "label": "ช่วงเวลารวบรวมข้อมูล (ไตรมาส 1,2,3,4)",
          "type": "radio",
          "options": ["1", "2", "3", "4"]
        }
      ]),
    },
    {
      "file": "KPI 1.3 คณะ",
      "description": "นักศึกษามีศักยภาพในการใช้เทคโนโลยีสารสนเทศ สอดคล้องกับมาตรฐานวิชาชีพ เช่น CAD/CAM, SOLIDWORKS, Autodesk Inventor, CST Microwave studio, Cisco Network Certified, AWS Cloud Certified, Fortinet Cyber Security Certified เป็นต้น",
      "questions": JSON.stringify([
        { "id": "q1", "label": "รหัสนักศึกษา", "type": "text" },
        { "id": "q2", "label": "ชื่อ - นามสกุล", "type": "text" },
        { "id": "q3", "label": "ชั้นปี", "type": "text" },
        { "id": "q4", "label": "ภาควิชา/สาขาวิชา", "type": "text" },
    
        {
          "id": "q5",
          "label": "นักศึกษามีผลสอบสมรรถนะในการใช้เทคโนโลยีสารสนเทศ",
          "type": "group",
          "children": [
            { "id": "q5_1", "label": "โปรแกรม/มาตรฐาน/หลักสูตร/รายวิชาที่เข้ารับการทดสอบ", "type": "text" },
            { "id": "q5_2", "label": "สถานที่/หน่วยงานที่จัด", "type": "text" },
            { "id": "q5_3", "label": "เกณฑ์การผ่าน", "type": "text" },
            { "id": "q5_4", "label": "ผลการสอบ", "type": "text" },
            {
              "id": "q5_5",
              "label": "ผลการประเมิน",
              "type": "radio",
              "options": ["ผ่าน", "ไม่ผ่าน"]
            },
            { "id": "q5_6", "label": "วัน/เดือน/ปี ที่ผ่านการประเมิน / Certificate", "type": "date-range" }
          ]
        },
        {
          "id": "q6",
          "label": "ช่วงเวลารวบรวมข้อมูล (ไตรมาส 1,2,3,4)",
          "type": "radio",
          "options": ["1", "2", "3", "4"]
        }
      ])
    },
    {
      "file": "RT KPI 1.4 คณะ",
      "description": "นักศึกษามีผลการทดสอบภาษาอังกฤษตามมาตรฐานสากลหรือเทียบเท่า TOEIC 450 ขึ้นไป",
      "questions": JSON.stringify([
        {
          "id": "q9",
          "label": "ช่วงเวลารวบรวมข้อมูล (ไตรมาส 1,2,3,4)",
          "type": "radio",
          "options": ["1", "2", "3", "4"]
        },
        { "id": "q1", "label": "รหัสนักศึกษา", "type": "text" },
        {
          "id": "q2",
          "label": "คำนำหน้า",
          "type": "radio",
          "options": ["นาย", "นาง", "นางสาว"]
        },
        { "id": "q3", "label": "ชื่อ - นามสกุล", "type": "text" },
        { "id": "q4", "label": "สาขาวิชา", "type": "text" },
        // { "id": "q5", "label": "คณะ", "type": "text" },
    
        {
          "id": "q6",
          "label": "ประเภทการสอบตามมาตรฐานสากล",
          "type": "radio",
          "options": ["TOEIC", "TOEFL", "IELTS", "RT-TEP", "อื่น ๆ (Etc.)"]
        },
    
        { "id": "q7", "label": "คะแนนที่ได้", "type": "text" },
        { "id": "q8", "label": "วัน/เดือน/ปี ที่ผ่านการประเมิน", "type": "date-range" },
        { "id": "q10", "label": "แนบไฟล์หลักฐาน (เช่น รูปใบคะแนน TOEIC)", "type": "file" },
      ])
    },
    {
      "file": "RT KPI 1.5 คณะ",
      "description": "นักศึกษาที่มีผลการเรียนในวิชาภาษาอื่น ๆ  ",
      "method" : "1.กิจกรรมส่งเสริมการเรียนการสอนด้วยภาษาอื่น ๆ นอกเหนือจากภาษาอังกฤษ \n2.ข้อมูลรายชื่อ/จำนวนนักศึกษาที่มีผลการเรียนในวิชาภาษาอื่น ๆ ที่มีชั่วโมงเรียนไม่น้อยกว่า 76 ชั่วโมงขึ้นไป ทุกPlatform ของคณะ (แสดงหลักฐํานกํารอบรม เช่น แคปหน้ําจอ ใบ Cer. )",
      "questions": JSON.stringify([
        {
          "id": "q11",
          "label": "ช่วงเวลารวบรวมข้อมูล (ไตรมาส 1,2,3,4)",
          "type": "radio",
          "options": ["1", "2", "3", "4"]
        },{
          "id": "q21",
          "label": "ภาษา",
          "type": "radio",
          "options": ["ญี่ปุ่น", "จีน", "เยอรมัน", "เกาหลี", "อิตาลี", "ฝรั่งเศส"]
        },{
          "id": "q6",
          "label": "รูปแบบการเรียน",
          "type": "radio",
          "options": ["Online", "Onsite2"]
        },
        { "id": "q1", "label": "รหัสนักศึกษา", "type": "text" },
        { "id": "q2", "label": "คำนำหน้า", "type": "text" },
        {
          "id": "q2",
          "label": "คำนำหน้า",
          "type": "radio",
          "options": ["นาย", "นาง","นางสาว"]
        },
        { "id": "q3", "label": "ชื่อ - นามสกุล", "type": "text" },
        { "id": "q4", "label": "สาขาวิชา", "type": "text" },
        { "id": "q5", "label": "ภาษาที่เรียน / รายวิชาภาษาอื่น ๆ (นอกจากอังกฤษ)", "type": "text" },
        { "id": "q9", "label": "คะแนน (ตัวเลข / A B C ฯลฯ / ผ่าน-ไม่ผ่าน)", "type": "text" },
        { "id": "q8", "label": "ระบุชื่อหน่วยงาน / Platform ที่จัดการเรียนสอน", "type": "text" },
        { "id": "q10", "label": "วัน/เดือน/ปี ที่สำเร็จหลักสูตร (ถ้ามีจัดทำ Cert)", "type": "date-range" },
      ]),
    },
    {
      "file": "KPI 1.6 คณะ",
      "description": "หลักสูตรที่มีรายวิชา หรือโครงงาน หรือกิจกรรม ที่ทำให้ผู้เรียนมีความเข้าใจ มีทักษะ และสามารถนำ AI ไปใช้ประโยชน์ ",
      "questions": JSON.stringify([
        {
          "id": "q1",
          "label": "หลักสูตรที่มีรายวิชา หรือโครงงาน หรือกิจกรรม ที่ทำให้ผู้เรียนมีความเข้าใจ มีทักษะ และสามารถนำ AI ไปใช้ประโยชน์",
          "type": "group",
          "children": [
            { "id": "q1_1", "label": "รหัสหลักสูตร - รายวิชา", "type": "text" },
            { "id": "q1_2", "label": "รายละเอียดรายวิชา", "type": "text" },
            { "id": "q1_3", "label": "ชื่อโครงการ/กิจกรรม", "type": "text" }
          ]
        },
        {
          "id": "q2",
          "label": "ระบุบุคลากรที่จัดโครงการหรือเรียนการสอน",
          "type": "text"
        },
        {
          "id": "q3",
          "label": "ภาควิชา/สาขาวิชา ที่ดำเนินการ",
          "type": "text"
        },
        {
          "id": "q4",
          "label": "รายละเอียดการนำ AI ไปใช้ประโยชน์",
          "type": "group",
          "children": [
            { "id": "q4_1", "label": "ด้านสังคม/ด้านการศึกษา", "type": "text" },
            { "id": "q4_2", "label": "ด้านเศรษฐกิจ/ธุรกิจ", "type": "text" },
            { "id": "q4_3", "label": "ด้านสิ่งแวดล้อม", "type": "text" },
            { "id": "q4_4", "label": "ปัญหาที่ได้รับการแก้ไขโดย AI", "type": "text" }
          ]
        },
        {
          "id": "q5",
          "label": "ช่วงเวลารวบรวมข้อมูล (ไตรมาส 1,2,3,4)",
          "type": "radio",
          "options": ["1", "2", "3", "4"]
        }
      ]),
    },
    {
      "file": "KPI 1.7 คณะ",
      "description": "หลักสูตรที่มีรายวิชา  หรือโครงงาน หรือกิจกรรม ที่ความสอดคล้องกับเป้าหมายการพัฒนาอย่างยั่งยืน (Sustainable Development Goals, SDGs)",
      "questions": JSON.stringify([
        {
          "id": "q1",
          "label": "หลักสูตรที่มีรายวิชา หรือโครงงาน หรือกิจกรรม ที่แสดงความเชื่อมโยงกับเป้าหมายการพัฒนาที่ยั่งยืน",
          "type": "group",
          "children": [
            { "id": "q1_1", "label": "รายชื่อหลักสูตร", "type": "text" },
            { "id": "q1_2", "label": "รายชื่อโครงการ", "type": "text" },
            { "id": "q1_3", "label": "รายชื่อกิจกรรม", "type": "text" },
            { "id": "q1_4", "label": "ระบุบุคลากร/นักศึกษา/ชั้นปี ที่จัดโครงการ", "type": "text" }
          ]
        },
        { "id": "q2", "label": "ภาควิชา/สาขาวิชา ที่ดำเนินการ", "type": "text" },
    
        {
          "id": "q3",
          "label": "SDGs ที่สอดคล้อง (1-17) (เลือกได้มากกว่า 1 ข้อ เช่น SDG 1 / SDG 3,5)", 
          "type": "text"
        },
    
        {
          "id": "q4",
          "label": "รายละเอียดความเชื่อมโยงกับเป้าหมายการพัฒนาที่ยั่งยืน",
          "type": "group",
          "children": [
            { "id": "q4_1", "label": "ด้านสังคม (บรรยายรายละเอียด/สอดคล้องกับตัวชี้วัด)", "type": "text" },
            { "id": "q4_2", "label": "ด้านเศรษฐกิจ (บรรยายรายละเอียด/สอดคล้องกับตัวชี้วัด)", "type": "text" },
            { "id": "q4_3", "label": "ด้านสิ่งแวดล้อม (บรรยายรายละเอียด/สอดคล้องกับตัวชี้วัด)", "type": "text" }
          ]
        },
    
        {
          "id": "q5",
          "label": "ช่วงเวลารวบรวมข้อมูล (ไตรมาส 1,2,3,4)",
          "type": "radio",
          "options": ["1", "2", "3", "4"]
        }
      ]),
    },
    {
      "file": "KPI 1.8 คณะ",
      "description": "หลักสูตรเรียนร่วมกับภาคประกอบการ (TM15, CWIE, Premium Course, etc.) ",
      "questions": JSON.stringify([
        { "id": "q1", "label": "สาขาวิชา", "type": "text" },
        { "id": "q2", "label": "ชื่อหลักสูตร (ระบุ)", "type": "text" },
        { "id": "q3", "label": "ภาควิชา/สาขาวิชาที่ดำเนินการ", "type": "text" },
        {
          "id": "q4",
          "label": "ประเภทหลักสูตร",
          "type": "radio",
          "options": ["TM15", "CWE", "Premium course", "อื่น ๆ (Etc.)"]
        },
        
    
        {
          "id": "q5",
          "label": "ชื่อสถานประกอบการที่มีความร่วมมือ และร่วมกิจกรรมตามความต้องการ",
          "type": "text"
        },
    
        {
          "id": "q6",
          "label": "วัน/เดือน/ปี ที่ทำข้อตกลง มหาวิทยาลัย/สถาบัน/ภาคี",
          "type": "date-range"
        }
      ]),
    },
    {
      "file": "KPI 1.9 คณะ",
      "description": "หลักสูตร/โปรแกรมเฉพาะที่ใช้เทคโนโลยี/นวัตกรรมเพื่อพัฒนาความเป็นผู้ประกอบการ ",
      "questions": JSON.stringify([
        { "id": "q1", "label": "รายชื่อหลักสูตร", "type": "text" },
        { "id": "q2", "label": "ภาควิชา/สาขาวิชา", "type": "text" },
    
        {
          "id": "q3",
          "label": "กลุ่มเทคโนโลยี/นวัตกรรมที่ใช้เพื่อพัฒนาความเป็นผู้ประกอบการ",
          "type": "group",
          "children": [
            { "id": "q3_1", "label": "Agro-food", "type": "checkbox" },
            { "id": "q3_2", "label": "Logistic", "type": "checkbox" },
            { "id": "q3_3", "label": "Digital Technology & Economy", "type": "checkbox" },
            { "id": "q3_4", "label": "Tourism & Creative", "type": "checkbox" },
            { "id": "q3_5", "label": "Health and Wellness", "type": "checkbox" }
          ]
        },
    
        {
          "id": "q4",
          "label": "ประเภทหลักสูตร/โปรแกรม",
          "type": "group",
          "children": [
            { "id": "q4_1", "label": "Bachelor’s", "type": "checkbox" },
            { "id": "q4_2", "label": "Master", "type": "checkbox" },
            { "id": "q4_3", "label": "Ph.D", "type": "checkbox" },
            { "id": "q4_4", "label": "Non-Degree", "type": "checkbox" }
          ]
        },
    
        {
          "id": "q5",
          "label": "รายวิชา/เทคโนโลยี/นวัตกรรมที่เกี่ยวข้อง (เพื่อพัฒนาความเป็นผู้ประกอบการ)",
          "type": "text"
        }
      ]),
    },
    {
      "file": "KPI 1.10 คณะ",
      "description": "นักศึกษาเข้าสู่กระบวนการบ่มเพาะเตรียมความพร้อมเป็นผู้ประกอบการ",
      "questions": JSON.stringify([
        { "id": "q1", "label": "ชื่อ - สกุล นศ. ที่เข้าร่วมกิจกรรม/โครงการ", "type": "text" },
        { "id": "q2", "label": "ชั้นปี", "type": "text" },
        { "id": "q3", "label": "ภาควิชา/สาขาวิชา", "type": "text" },
        { "id": "q4", "label": "วัน/เดือน/ปี ที่จัดกิจกรรม/โครงการ", "type": "date-range" },
        {
          "id": "q5",
          "label": "กิจกรรม/โครงการด้านพาณิชย์/เตรียมความพร้อมเป็นผู้ประกอบการ",
          "type": "text"
        },
        {
          "id": "q6",
          "label": "สรุป/รายงานผลการจัดกิจกรรม/โครงการ",
          "type": "text"
        },
        { "id": "q7", "label": "หน่วยงาน/สถานที่ ที่จัด", "type": "text" },
        {
          "id": "q8",
          "label": "ช่วงเวลารวบรวมข้อมูล (ไตรมาส 1,2,3,4)",
          "type": "radio",
          "options": ["1", "2", "3", "4"]
        }
      ]),
    },
    {
      "file": "KPI 1.11 คณะ",
      "description": "นักศึกษาหรือบัณฑิตได้รับรางวัลด้านผู้ประกอบการ (Startup Awards)",
      "questions": JSON.stringify([
        { "id": "q1", "label": "รหัสนักศึกษา", "type": "text" },
        { "id": "q2", "label": "ชื่อ-นามสกุล", "type": "text" },
        { "id": "q3", "label": "ชั้นปี", "type": "text" },
        { "id": "q4", "label": "ภาควิชา/สาขาวิชา", "type": "text" },
        { "id": "q5", "label": "ชื่อผลงานที่ได้รับรางวัล", "type": "text" },
        { "id": "q6", "label": "ชื่อรางวัลผู้ประกอบการ (Startup Awards) ที่ได้รับ", "type": "text" },
        { "id": "q7", "label": "วัน/เดือน/ปี ที่ได้รับรางวัล", "type": "date-range" },
    
        {
          "id": "q8",
          "label": "หน่วยงานที่มอบรางวัล",
          "type": "group",
          "children": [
            { "id": "q8_1", "label": "ภายใน มทรธ. / คณะ / กก.ผู้ทรงคุณวุฒิภายนอก (ระบุชื่อ)", "type": "text" },
            { "id": "q8_2", "label": "องค์กรภายนอก (ระบุชื่อ)", "type": "text" },
            { "id": "q8_3", "label": "เครือข่ายองค์กรในประเทศ (ระบุชื่อ)", "type": "text" },
            { "id": "q8_4", "label": "องค์กรระดับชาติ (ระบุชื่อ)", "type": "text" },
            { "id": "q8_5", "label": "องค์กรระดับนานาชาติ (ระบุชื่อ)", "type": "text" }
          ]
        },
    
        {
          "id": "q9",
          "label": "รูปแบบผลงาน",
          "type": "group",
          "children": [
            { "id": "q9_1", "label": "ผลงานทีม (ระบุชื่อทีม)", "type": "text" },
            { "id": "q9_2", "label": "ผลงานเดี่ยว (ระบุชื่อผลงาน)", "type": "text" }
          ]
        },
    
        {
          "id": "q10",
          "label": "ช่วงเวลารวบรวมข้อมูล (ไตรมาส 1,2,3,4)",
          "type": "radio",
          "options": ["1", "2", "3", "4"]
        }
      ]),
    },
    {
      "file": "KPI 1.12 คณะ",
      "description": "นวัตกรรมของผู้เรียน ที่ถูกนำไปใช้ประโยชน์ เกิดการสร้างคุณค่าหรือมูลค่าเชิงพาณิชย์หรือได้รับรางวัลในระดับชาติหรือนานาชาติ",
      "method" : "1.ผลงานของนักศึกษาที่เป็นผลงาน/นวัตกรรมทางวิชาการหรือวิชาชีพได้จากการออกแบบ การประดิษฐ์และสร้างสรรค์ \n2.การสร้างคุณค่า หรือมูลค่าเชิงพาณิชย์ หมายถึง การลดต้นทุน ลด หรือทดแทนการนำเข้า ปรับปรุงกระบวนการผลิต พัฒนาคุณภาพ ทาผลิตภัณฑ์ใหม่ แก้ปัญหาทางเทคนิควิชาการประกอบการพัฒนาต่อยอดและอื่น ๆ ตํามวัตถุประสงค์ที่ผู้ใช้ต้องการ",
      "questions": JSON.stringify([
        { "id": "q1", "label": "รหัสนักศึกษา", "type": "text" },
        { "id": "q2", "label": "คำนำหน้า", "type": "text" },
        { "id": "q3", "label": "ชื่อ - นามสกุล", "type": "text" },
        { "id": "q4", "label": "ภาควิชา/สาขาวิชา", "type": "text" },
        { "id": "q5", "label": "นวัตกรรม (ผลงานนักศึกษา)", "type": "text" },
    
        {
          "id": "q6",
          "label": "ระดับรางวัล",
          "type": "group",
          "children": [
            { "id": "q6_1", "label": "ระดับชาติ (ระบุรางวัล)", "type": "text" },
            { "id": "q6_2", "label": "ผลงานเดี่ยว (ระบุรางวัล)", "type": "text" }
          ]
        },
    
        {
          "id": "q7",
          "label": "ผลกระทบที่เกิดขึ้น สร้างคุณค่า (อธิบายถึงคุณค่าในทาง เศรษฐกิจ สังคม สิ่งแวดล้อม)",
          "type": "group",
          "children": [
            { "id": "q7_1", "label": "ด้านเศรษฐกิจ", "type": "text" },
            { "id": "q7_2", "label": "ด้านสังคม", "type": "text" },
            { "id": "q7_3", "label": "ด้านสิ่งแวดล้อม", "type": "text" },
            { "id": "q7_4", "label": "สร้างมูลค่า (ระบุมูลค่าเป็นบาท)", "type": "number" },
          ]
        },
        {
          "id": "q8",
          "label": "ช่วงเวลารวบรวมข้อมูล (ไตรมาส 1,2,3,4)",
          "type": "radio",
          "options": ["1", "2", "3", "4"]
        }
        
      ]),
    },
    {
      "file": "RT KPI 2.7",
      "description": "จำนวนผลงานวิจัย สิ่งประดิษฐ์ นวัตกรรมหรืองานสร้างสรรค์ที่ได้รับเลขที่คำขอ/เลขที่สิทธิบัตร หรืออนุสิทธิบัตรหรือขึ้นบัญชีนวัตกรรม",
      "method" : "ผลงานวิจัย สิ่งประดิษฐ์ นวัตกรรม หรืองานสร้างสรรค์ ที่ได้รับเลขที่คำขอ หรือเลขที่สิทธิบัตรหรืออนุสิทธิบัตร หรือบัญชีนวัตกรรม จะต้องอยู่ระหว่างวันที่ 1 ตุลาคม 2567 ถึง 30 กันยายน 2568",
      "questions": JSON.stringify([
        { "id": "q1", "label": "ชื่อผลงานที่ยื่นขอรับการคุ้มครองฯ", "type": "text" },
        { "id": "q2", "label": "ชื่อผู้ขอรับการคุ้มครองฯ", "type": "text" },
        { "id": "q3", "label": "ประเภทการคุ้มครอง", "type": "text" },
        { "id": "q4", "label": "คำขอเลขที่", "type": "text" },
        { "id": "q5", "label": "ยื่นคำขอวันที่", "type": "date-range" },
    
        {
          "id": "q6",
          "label": "ได้รับเลขที่สิทธิบัตร อนุสิทธิบัตร และบัญชีนวัตกรรม",
          "type": "group",
          "children": [
            { "id": "q6_1", "label": "เลขที่", "type": "text" },
            { "id": "q6_2", "label": "วันที่ได้รับเลขที่", "type": "date-range" }
          ]
        }
      ]),
    },
    {
      "file": "RT KPI 3.1_(งปม. 68)",
      "description": "หลักสูตร Re-skill, Up-skill, New-skill ที่พัฒนากำลังคนในอุตสาหกรรมเป้าหมาย และ EEC ที่มีผู้เรียนหรือมีผู้เข้าร่วมอบรม (หลักสูตรใหม่ ปีงบประมาณ 2568)",
      "questions": JSON.stringify([
          { "id": "q1", "label": "รายชื่อหลักสูตรอบรมระยะสั้น (Re-skill, Up-skill, New-skill) หรือหลักสูตร Non degreeที่ได้รับการอนุมัติหลักสูตรโดยสภาวิชาการ มทร.ธัญบุรี(ปีงบประมาณ 2568)", "type": "text" },
          { "id": "q2", "label": "วัน เดือน ปี ที่อนุมัติหลักสูตร", "type": "date-range" },
          { "id": "q3", "label": "จำนวนชั่วโมงตามหลักสูตรอบรม", "type": "text" },
          { "id": "q4", "label": "ผู้รับผิดชอบ", "type": "text" },
          { "id": "q5", "label": "ประเภททักษะ(โปรดระบุ Re-skill,Up-skill, New-skill)", "type": "text" },
          {
              "id": "q6",
              "label": "อุตสาหกรรมที่เกี่ยวข้อง(โปรดระบุประเภทอุตสาหกรรม)",
              "type": "group",
              "children": [
                  { "id": "qุ6_1", "label": "10 + 4 S-curve", "type": "text" },
                  { "id": "q6_2", "label": "EEC", "type": "text" },
              ]
          },
          { "id": "q7", "label": "ชื่อ - สกุล ผู้เข้ารับการอบรม", "type": "text" },
          { "id": "q8", "label": "วัน/เดือน/ปี ที่เข้ารับการอบรม", "type": "date-range" },
          { "id": "q9", "label": "หมายเหตุ", "type": "text" },
      ]),
  },
  {
      "file": "RT KPI 3.2",
      "description": "ผู้ที่ได้รับการถ่ายทอด องค์ความรู้ เทคโนโลยี นวัตกรรม ความคิดสร้างสรรค์แล้วนำไปใช้ประโยชน์ และเกิดผลกระทบในทางบวก",
      "questions": JSON.stringify([
          {
              "id": "q1",
              "label": "โครงการ/กิจกรรม ถ่ายทอดองค์ความรู้ เทคโนโลยี นวัตกรรม ความคิดสร้างสรรค์ ของหน่วยงาน",
              "type": "group",
              "children": [
                  { "id": "q1_1", "label": "โครงการ/กิจกรรม", "type": "text" },
                  { "id": "q1_2", "label": "วัน/เดือน/ปี ที่จัดโครงการ/กิจกรรม", "type": "date-range" },
                  { "id": "q1_3", "label": "ผู้รับผิดชอบ", "type": "text" },
                  { "id": "q1_4", "label": "จำนวนผู้เข้าร่วมโครงการทั้งหมด", "type": "text" },
              ],
          },
          { "id": "q2", "label": "ชื่อ - สกุล ผู้ที่ได้รับการถ่ายทอด แล้วนำไปใช้ประโยชน์", "type": "text" },
          { "id": "q3", "label": "ชื่อชุมชน/พื้นที่/หน่วยงาน (โปรดระบุชื่อ)", "type": "text" },
          { "id": "q4", "label": "อธิบายผลลัพธ์/ผลกระทบในทางบวก", "type": "text" },
      ]),
  },
  {
      "file": "RT KPI 3.3",
      "description": "องค์ความรู้ เทคโนโลยี นวัตกรรม ด้านศิลปวัฒนธรรมหรือภูมิปัญญาท้องถิ่น ที่นำไปใช้ให้เกิดการอนุรักษ์ สืบสานหรือพัฒนาเศรษฐกิจสร้างสรรค์",
      "questions": JSON.stringify([
          {
              "id": "q1",
              "label": "องค์ความรู้ เทคโนโลยี นวัตกรรม ด้านศิลปวัฒนธรรมหรือภูมิปัญญาท้องถิ่น",
              "type": "group",
              "children": [
                  { "id": "q1_1", "label": "ชื่อองค์ความรู้ เทคโนโลยี นวัตกรรม", "type": "text" },
                  { "id": "q1_2", "label": "โครงการ/กิจกรรม", "type": "text" },
                  { "id": "q1_3", "label": "วัน/เดือน/ปี", "type": "date-range" },
                  { "id": "q1_4", "label": "สถานที่ดำเนินการชุมชน/สถานประกอบการ", "type": "text" },
              ],
          },
          { "id": "q2", "label": "อธิบายลักษณะการอนุรักษ์สืบสานหรือพัฒนาเศรษฐกิจสร้างสรรค์", "type": "text" },
      ]),
  },
  {
      "file": "RT KPI 3.4",
      "description": "หน่วยงานของรัฐ ท้องถิ่น เอกชน และระดับสากล ที่ร่วมดำเนินโครงการบริการวิชาการ หรือสนับสนุนงบประมาณในการจัดบริการวิชาการ",
      "questions": JSON.stringify([
          { "id": "q1", "label": "รายชื่อหน่วยงานของรัฐ  เอกชน ท้องถิ่น หรือระดับสากล ที่ร่วมดำเนินโครงการบริการวิชาการ หรือสนับสนุนงบประมาณในการจัดบริการวิชาการ", "type": "text" },
          {
              "id": "q2",
              "label": "รายละเอียดกิจกรรมที่ดำเนินโครงการบริการวิชาการหรือสนับสนุนงบประมาณในการจัดบริการวิชาการ",
              "type": "group",
              "children": [
                  { "id": "q2_1", "label": "*** โปรดระบุรายละเอียดความร่วมมือเพื่อการให้บริการวิชาการ และกิจกรรมที่จะเกิดขึ้น", "type": "text" },
                  { "id": "q2_2", "label": "ระบุงบประมาณที่ได้รับการสนับสนุน (ถ้ามี)", "type": "text" },
              ],
          },
          { "id": "q3", "label": "รายชื่อหน่วยงานที่ได้รับการพัฒนาหรือช่วยเหลือ", "type": "text" },
          { "id": "q4", "label": "วัน/เดือน/ปี ที่ทำกิจกรรม", "type": "date-range" },
      ]),
  },
  {
      "file": "RT KPI 3.5",
      "description": "งบประมาณจากแหล่งทุนภายนอกสนับสนุนการสร้างผู้ประกอบการ/ธุรกิจใหม่ (Startup Co-Investment Funding)",
      "questions": JSON.stringify([
          { "id": "q1", "label": "ระบุรายชื่อแหล่งทุนภายนอกที่สนับสนุนงบประมาณการสร้างผู้ประกอบการ/ธุรกิจใหม่ (Startup Co-Investment Funding)", "type": "text" },
          { "id": "q2", "label": "จำนวนเงินที่ได้รับการสนับสนุน", "type": "text" },
          { "id": "q3", "label": "วัน/เดือน/ปี ที่ได้รับการสนับสนุน", "type": "date-range" },
          { "id": "q4", "label": "อธิบาย การสนับสนุนการสร้างผู้ประกอบการ/ธุรกิจใหม่", "type": "text" },
      ]),
  },
  {
      "file": "RT KPI 4.1",
      "description": "ผู้บริหารระดับต้น ระดับกลาง ระดับสูง ได้รับการพัฒนาทักษะเชิงบริหารจัดการ และนำมาใช้ประโยชน์ในการทำงาน",
      "questions": JSON.stringify([
          {
            "id": "q1",
            "label": "ไตรมาสที่",
            "type": "radio",
            "options": ["1", "2", "3", "4"]
          },
          { "id": "q2", "label": "ชื่อ-นามสกุล", "type": "text" },
          { "id": "q3", "label": "ระบุตำแหน่งทางการบริหาร เช่น คณบดี ผู้อำนวยการ รองคณบดี รองผู้อำนวยการ หัวหน้างาน เป็นต้น", "type": "text" },
          {
              "id": "q4",
              "label": "การพัฒนาทักษะในหลักสูตรเชิงบริหารจัดการ",
              "type": "group",
              "children": [
                  { "id": "q4_1", "label": "หน่วยงานที่จัดอบรม", "type": "text" },
                  { "id": "q4_2", "label": "หลักสูตร/หัวข้อ ที่การพัฒนาทักษะในหลักสูตรเชิงบริหารจัดการ", "type": "text" },
                  { "id": "q4_3", "label": "ระยะเวลาที่ไป (ว/ด/ป)", "type": "date-range" },
                  { "id": "q4_4", "label": "สถานที่สัมมนา", "type": "text" },
              ],
          },
          { "id": "q5", "label": "อธิบายการนำความรู้ที่ได้จากการอบรม พัฒนาทักษะเชิงบริหารจัดการมาใช้ประโยชน์กับการทำงาน", "type": "text" },
      ]),
  },
  {
      "file": "RT KPI 4.2",
      "description": "บุคลากรที่ได้รับการพัฒนา สามารถผ่านมาตรฐาน Certified จากหน่วยงานภายนอก",
      "method" : "ผลการผ่านการฝึกอบรม เช่น ใบประกาศนียบัตร, ใบรับรองการผ่านมาตรฐานการฝึกอบรมที่ตรงตามสายวิชาชีพ เป็นต้น",
      "questions": JSON.stringify([
          {
            "id": "q1",
            "label": "ไตรมาสที่",
            "type": "radio",
            "options": ["1", "2", "3", "4"]
          },
          { "id": "q2", "label": "ชื่อ-นามสกุล", "type": "text" },
          { "id": "q3", "label": "ตำแหน่งทางวิชาการ/ตำแหน่งทางวิชาชีพ เช่น อาจารย์ภาควิชา ,เจ้าหน้าที่บริหารงานทั่วไป เป็นต้น", "type": "text" },
          { "id": "q4", "label": "สาขา/ฝ่ายงานอื่น ๆ ", "type": "text" },
          {
              "id": "q5",
              "label": "บุคลากรผ่านมาตรฐาน Certified จากหน่วยงานภายนอก",
              "type": "group",
              "children": [
                  { "id": "q5_1", "label": "ระบุชื่อ หลักสูตร/วิชา/เรื่อง ที่ได้รับการพัฒนาตามปรากฎใน Certified จากหน่วยงานภายนอก", "type": "text" },
                  { "id": "q5_2", "label": "หน่วยงานที่จัดฝึกอบรม", "type": "text" },
                  { "id": "q5_3", "label": "สถานที่จัดฝึกอบรม", "type": "text" },
                  { "id": "q5_4", "label": "วัน/เดือน/ปี ที่อบรม", "type": "date-range" },
                  { "id": "q5_5", "label": "วัน/เดือน/ปี ที่ได้รับ Certified", "type": "date-range" },
                  { "id": "q5_6", "label": "รูปภาพของใบ certificated", "type": "file" },
              ],
          },
          { "id": "q6", "label": "หมายเหตุ", "type": "text" },
      ]),
  },
  {
      "file": "RT KPI 4.3",
      "description": "อาจารย์ที่ไปฝึกประสบการณ์วิชาชีพในสถานประกอบการหรือแลกเปลี่ยนความรู้สู่ภาคธุรกิจ/อุตสาหกรรม/ชุมชน",
      "method" : "1.อาจารย์เป็นที่ปรึกษาให้กับสถานประกอบการ \n2.อาจารย์ผ่านการฝึกประสบการณ์วิชาชีพในสถานประกอบการ \n3.อาจารย์เป็นวิทยาการให้กับสถานประกอบการในเรื่องที่เชี่ยวชาญ \n4.อาจารย์ที่เข้าร่วมโครงการ Talent mobility \n5.อาจารย์ที่เข้าร่วมโครงการ ITAP",
      "questions": JSON.stringify([
          {
            "id": "q1",
            "label": "ไตรมาสที่",
            "type": "radio",
            "options": ["1", "2", "3", "4"]
          },
          { "id": "q2", "label": "ชื่อ-นามสกุล", "type": "text" },
          { "id": "q3", "label": "สาขา", "type": "text" },
          {
              "id": "q4",
              "label": "ประเภทการฝึกประสบการณ์วิชาชีพ",
              "type": "radio",  // เปลี่ยนจาก "group" เป็น "radio"
              "options": ["ฝังตัว/ฝึกประสบการณ์","เป็นวิทยากร","เป็นที่ปรึกษา","โครงการ Talent Mobility","โครงการ ITAP","อื่น ๆ (Etc.)"],
          },
          {
              "id": "q5",
              "label": "การฝึกประสบการณ์วิชาชีพ",
              "type": "group",
              "children": [
                  { "id": "q5_1", "label": "ชื่อหน่วยงาน/สถานประกอบการอุตสาหกรรม/ชุมชน", "type": "text" },
                  { "id": "q5_2", "label": "หลักสูตร/หัวข้อ ที่ฝึกประสบการณ์", "type": "text" },
                  { "id": "q5_3", "label": "ระยะเวลาที่ไป (ว/ด/ป)", "type": "date-range" },
                  { "id": "q5_4", "label": "สถานที่", "type": "text" },
              ],
          },
      ]),
  },
  {
      "file": "RT KPI 4.4",
      "description": "อาจารย์ได้รับรางวัลระดับชาติและนานาชาติ ",
      "method" : "รางวัล ที่ได้รับการยอมรับระดับชาติหรือนานาชาติ ในโครงการที่เข้าร่วมแข่งขัน พิจารณาจากการมีเอกสารรับรอง พร้อมแนบหลักฐาน ข่าวประชาสัมพันธ์ในหนังสือพิมพ์ เอกสารประชาสัมพันธ์ต่าง ๆโล่รางวัล ใบประกาศเกียรติบัตร หนังสือเชิดชูเกียรติ",
      "questions": JSON.stringify([
          {
            "id": "q1",
            "label": "ไตรมาสที่",
            "type": "radio",
            "options": ["1", "2", "3", "4"]
          },
          { "id": "q2", "label": "ชื่อ-นามสกุล", "type": "text" },
          { "id": "q3", "label": "สาขา", "type": "text" },
          { "id": "q4", "label": "ชื่อผลงาน/โครงการ", "type": "text" },
          { "id": "q5", "label": "ชื่อรางวัล", "type": "text" },
          {
              "id": "q6",
              "label": "ประเภทรางวัล",
              "type": "radio",  // เปลี่ยนจาก "group" เป็น "radio"
              "options": ["ชาติ","นานาชาติ"]
          },
          { "id": "q7", "label": "วัน/เดือน/ปี ที่ได้รับรางวัล", "type": "date-range" },
          { "id": "q8", "label": "ชื่องานที่เข้าร่วมประกวด", "type": "text" },
      ]),
  },
  {
      "file": "RT KPI 4.5",
      "description": "อาจารย์ได้รับรางวัลระดับชาติและนานาชาติ ",
      "questions": JSON.stringify([
          { "id": "q1", "label": "ชื่อ - สกุล", "type": "text" },
          { "id": "q2", "label": "หลักสูตรที่ได้รับการอบรมตามเกณฑ์มาตรฐานคุณภาพอาจารย์ (PSF - Professional Standard Framework)", "type": "text" },
          { "id": "q3", "label": "วัน/เดือน/ปี ที่เข้ารับการอบรม", "type": "date-range" },
          {
              "id": "q4",
              "label": "ผ่านเกณฑ์การประเมินตามมาตรฐาน PSF",
              "type": "radio",  // เปลี่ยนจาก "group" เป็น "radio"
              "options": ["ระดับ 1","ระดับ 2","ระดับ 3","ระดับ 4"]
          },
      ]),
  },
  {
      "file": "RT KPI 4.7",
      "description": "จำนวนนักศึกษาต่างชาติ ที่ลงทะเบียนเรียนในระบบ",
      "questions": JSON.stringify([
          {
            "id": "q1",
            "label": "ไตรมาสที่",
            "type": "radio",
            "options": ["1", "2", "3", "4"]
          },
          { "id": "q2", "label": "รหัสนักศึกษา", "type": "text" },
          { "id": "q3", "label": "ชื่อ -  สกุล นักศึกษาต่างชาติ", "type": "text" },
          { "id": "q4", "label": "สาขาวิชา/ภาควิชา", "type": "text" },
          { "id": "q5", "label": "ชั้นปี", "type": "text" },
          { "id": "q6", "label": "มาจากสถาบัน", "type": "text" },
          { "id": "q7", "label": "มาจากประเทศ", "type": "text" },
          {
              "id": "q8",
              "label": "ระยะเวลา",
              "type": "group",
              "children": [
                  { "id": "q8_1", "label": "ว/ด/ป ที่มา", "type": "date-range" },
                  { "id": "q8_2", "label": "ว/ด/ป ที่กลับ", "type": "date-range" },
              ],
          },
      ]),
  },
  {
      "file": "RT KPI 4.8",
      "description": "จำนวนบุคลากรต่างชาติ",
      "questions": JSON.stringify([
          {
            "id": "q1",
            "label": "ไตรมาสที่",
            "type": "radio",
            "options": ["1", "2", "3", "4"]
          },
          { "id": "q2", "label": "ชื่อ -  สกุล ", "type": "text" },
          { "id": "q3", "label": "ภาควิชา/สาขาวิชา", "type": "text" },
          { "id": "q4", "label": "สัญชาติ", "type": "text" },
          { "id": "q5", "label": "มาจากประเทศ", "type": "text" },
          {
              "id": "q6",
              "label": "ระยะเวลา",
              "type": "group",
              "children": [
                  { "id": "q6_1", "label": "ว/ด/ป ที่มา", "type": "date-range" },
                  { "id": "q6_2", "label": "ว/ด/ป ที่กลับ", "type": "date-range" },
              ],
          },
      ]),
  },{
      "file": "7.1ก-2",
      "description": "ก-2 ร้อยของบัณฑิตที่สอบผ่านใบประกอบวิชาชีพได้ในครั้งแรก",
      "questions": JSON.stringify([
          { "id": "q1", "label": "ภาควิชา", "type": "text" },
          { "id": "q2", "label": "ชื่อ-นามสกุล", "type": "text" },
          { "id": "q3", "label": "รหัสนักศึกษา", "type": "text" },
          { "id": "q4", "label": "ชื่อใบประกอบวิชาชีพ", "type": "text" },
          { "id": "q5", "label": "ครั้งที่สอบ", "type": "number" },
          {
            "id": "q6",
            "label": "ผลการสอบ",
            "type": "radio",
            "options": ["ผ่าน", "ไม่ผ่าน"]
          },
          { "id": "q7", "label": "วันเดือนปีที่ผ่านการสอบ", "type": "date" },
          { "id": "q8", "label": "แนบรูปผลการสอบ", "type": "file" },
      ]),
  },{
      "file": "7.1ก-5",
      "description": "ก-5 ร้อยละของผลงานตีพิมพ์ในระดับนานาชาติของ",
      "questions": JSON.stringify([
          { "id": "q1", "label": "ภาควิชา", "type": "text" },
          { "id": "q2", "label": "ชื่อ-นามสกุล", "type": "text" },
          { "id": "q3", "label": "ชั้นปีที่", "type": "number" },
          { "id": "q4", "label": "รหัสนักศึกษา", "type": "text" },
          {
            "id": "q5",
            "label": "ระดับการศึกษา",
            "type": "radio",
            "options": ["ปริญญาโท", "ปริญญาเอก"]
          },
          {
            "id": "q6",
            "label": "ประเภทผลงาน",
            "type": "radio",
            "options": ["ระดับชาติ", "ระดับนานาชาติ"]
          },{
            "id": "q7",
            "label": "ประเภทการตีพิมพ์",
            "type": "radio",
            "options": ["ตีพิมพ์ในวารสารวิชาการ (Journal)", "การเผยแพร่ผ่านรายงานสืบเนื่องการประชุมวิชาการ "]
          },
          { "id": "q8", "label": "ชื่อผลงานตีพิมพ์", "type": "text" },
          { "id": "q9", "label": "จำนวนหน้า", "type": "number" },
          { "id": "q10", "label": "ชื่องานประชุมวิชาการหรือ ชื่อวารสาร", "type": "text" },
          {
          "id": "q11",
          "label": "",
          "type": "group",
          "children": [
            {
              "id": "q11_1",
              "label": "ผลงานตีพิมพ์ในระดับนานาชาติของบัณฑิตศึกษาสามารถตอบโจทย์ 10+2 อุตสาหกรรมเป้าหมายประเทศ",
              "type": "radio",
              "options": ["ใช่", "ไม่"]
            },
            { "id": "q11_2", "label": "อุตสาหกรรมยานยนต์สมัยใหม่", "type": "checkbox" },
            { "id": "q11_3", "label": "อุตสาหกรรมการแปรรูปอาหาร", "type": "checkbox" },
            { "id": "q11_4", "label": "อุตสาหกรรมอิเล็กทรอนิกส์อัจฉริยะ", "type": "checkbox" },
            { "id": "q11_5", "label": "อุตสาหกรรมหุ่นยนต์", "type": "checkbox" },
            { "id": "q11_6", "label": "อุตสาหกรรมการท่องเที่ยวกลุ่มรายได้ดีและการท่องเที่ยวเชิงสุขภา", "type": "checkbox" },
            { "id": "q11_7", "label": "อุตสาหกรรมการบินและโลจิสติกส์", "type": "checkbox" },
            { "id": "q11_8", "label": "อุตสาหกรรมเชื้อเพลิงชีวภาพและเคมีชีวภาพ", "type": "checkbox" },
            { "id": "q11_9", "label": "การเกษตรและเทคโนโลยีชีวภาพ", "type": "checkbox" },
            { "id": "q11_10", "label": "อุตสาหกรรมการแพทย์ครบวงจร", "type": "checkbox" },
            { "id": "q11_11", "label": "อุตสาหกรรมดิจิตอล", "type": "checkbox" },
            { "id": "q11_12", "label": "ระบบราง", "type": "checkbox" },
            { "id": "q11_13", "label": "อากาศยาน", "type": "checkbox" },
          ]
        },
        {
          "id": "q12",
          "label": "",
          "type": "group",
          "children": [
            {
              "id": "q12_1",
              "label": "ผลงานตีพิมพ์ในระดับนานาชาติของบัณฑิตศึกษาสามารถตอบโจทย์ 4+2 อุตสาหกรรมตามนโยบาย",
              "type": "radio",
              "options": ["ใช่", "ไม่"]
            },
            { "id": "q12_2", "label": "เซมิคอนดักเตอร์", "type": "checkbox" },
            { "id": "q12_3", "label": "ปัญญาประดิษฐ์ (AI)", "type": "checkbox" },
            { "id": "q12_4", "label": "Electric Vehicle (EV)", "type": "checkbox" },
            { "id": "q12_5", "label": "Clean Energy Transition", "type": "checkbox" },
            { "id": "q12_6", "label": "Advanced Medical Devices", "type": "checkbox" },
            { "id": "q12_7", "label": "Sustainable Resources & Environment", "type": "checkbox" },
          ]
        },
      ]),
  },{
      "file": "7.1ก-33",
      "description": "ก-33 จำนวนโครงการให้ความรู้เกี่ยวกับความสำคัญของการประกอบวิชาชีพวิศวกร",
      "questions": JSON.stringify([
          { "id": "q1", "label": "ภาควิชา", "type": "text" },
          { "id": "q2", "label": "ชื่อโครงการ", "type": "text" },
          { "id": "q3", "label": "จำนวนนักศึกษา", "type": "number" },
          { "id": "q4", "label": "สถานที่ดำเนินการ", "type": "text" },
          { "id": "q5", "label": "รายละเอียดของโครงการ", "type": "text" },
          { "id": "q6", "label": "ระยะเวลา", "type": "date-range" },
      ]),
  },{
      "file": "7.1ก-34,7.1ก-35",
      "description": "ก-34 ร้อยละของโครงงานนักศึกษา ที่สามารถตอบโจทย์ 10+2 อุตสาหกรรมเป้าหมายประเทศ \n ก-35 ร้อยละของโครงงานนักศึกษา ที่สามารถตอบโจทย์ 4+2 อุตสาหกรรมตามนโยบายใหม่ของรัฐบาล",
      "questions": JSON.stringify([
          { "id": "q1", "label": "ภาควิชา", "type": "text" },
          { "id": "q2", "label": "สาขา", "type": "text" },
          { "id": "q3", "label": "ชื่อ-นามสกุล", "type": "text" },
          { "id": "q4", "label": "รหัสนักศึกษา", "type": "text" },
          { "id": "q5", "label": "ชื่อโครงงาน", "type": "text" },
          { "id": "q6", "label": "บทคัดย่อ", "type": "text" },
          { "id": "q7", "label": "คำสำคัญ", "type": "text" },
          {
          "id": "q8",
          "label": "",
          "type": "group",
          "children": [
            {
              "id": "q8_1",
              "label": "โครงงานนักศึกษาสามารถตอบโจทย์ 10+2 อุตสาหกรรมเป้าหมายประเทศ",
              "type": "radio",
              "options": ["ใช่", "ไม่"]
            },
            { "id": "q8_2", "label": "อุตสาหกรรมยานยนต์สมัยใหม่", "type": "checkbox" },
            { "id": "q8_3", "label": "อุตสาหกรรมการแปรรูปอาหาร", "type": "checkbox" },
            { "id": "q8_4", "label": "อุตสาหกรรมอิเล็กทรอนิกส์อัจฉริยะ", "type": "checkbox" },
            { "id": "q8_5", "label": "อุตสาหกรรมหุ่นยนต์", "type": "checkbox" },
            { "id": "q8_6", "label": "อุตสาหกรรมการท่องเที่ยวกลุ่มรายได้ดีและการท่องเที่ยวเชิงสุขภา", "type": "checkbox" },
            { "id": "q8_7", "label": "อุตสาหกรรมการบินและโลจิสติกส์", "type": "checkbox" },
            { "id": "q8_8", "label": "อุตสาหกรรมเชื้อเพลิงชีวภาพและเคมีชีวภาพ", "type": "checkbox" },
            { "id": "q8_9", "label": "การเกษตรและเทคโนโลยีชีวภาพ", "type": "checkbox" },
            { "id": "q8_10", "label": "อุตสาหกรรมการแพทย์ครบวงจร", "type": "checkbox" },
            { "id": "q8_11", "label": "อุตสาหกรรมดิจิตอล", "type": "checkbox" },
            { "id": "q8_12", "label": "ระบบราง", "type": "checkbox" },
            { "id": "q8_13", "label": "อากาศยาน", "type": "checkbox" },
          ]
        },
        {
          "id": "q9",
          "label": "",
          "type": "group",
          "children": [
            {
              "id": "q9_1",
              "label": "ผลงานตีพิมพ์ในระดับนานาชาติของบัณฑิตศึกษาสามารถตอบโจทย์ 4+2 อุตสาหกรรมตามนโยบาย",
              "type": "radio",
              "options": ["ใช่", "ไม่"]
            },
            { "id": "q9_2", "label": "เซมิคอนดักเตอร์", "type": "checkbox" },
            { "id": "q9_3", "label": "ปัญญาประดิษฐ์ (AI)", "type": "checkbox" },
            { "id": "q9_4", "label": "Electric Vehicle (EV)", "type": "checkbox" },
            { "id": "q9_5", "label": "Clean Energy Transition", "type": "checkbox" },
            { "id": "q9_6", "label": "Advanced Medical Devices", "type": "checkbox" },
            { "id": "q9_7", "label": "Sustainable Resources & Environment", "type": "checkbox" },
          ]
        },
      ]),
  },{
      "file": "7.1ก-3,7.1ก-4,7.1ก-27,7.1ก-28,7.1ก-29,7.1ก-30,7.1ก-31,7.1ก-32",
      "description": "ก-3 ร้อยละของบัณฑิตปริญญาตรีที่ได้งานทำภายใน 1 ปี\nก-4  ค่าเฉลี่ยเงินเดือนของบัณฑิตปริญญาตรีที่ได้งานทำภายใน 1 ปี\nก-27 ร้อยละบัณฑิตปริญญาตรีที่ได้งานทำตรงสาขาที่สำเร็จ\nก-28 จำนวนบัณฑิตด้านระบบรางที่ได้งานทำด้านระบบราง\nก-29 จำนวนเงินเดือนเฉลี่ยบัณฑิตด้านระบบรางก-30 จำนวนบัณฑิตด้านอากาศยานที่ได้งานทำด้านอากาศยาน\nก-31 จำนวนเงินเดือนเฉลี่ยบัณฑิตด้านอากาศยาน\nก-32 ร้อยละของบัณฑิตที่ได้งานทำในตลาดงานสำคัญหรือองค์กรที่มีชื่อเสียง",
      "questions": JSON.stringify([
          { "id": "q1", "label": "ภาควิชา", "type": "text" },
          { "id": "q2", "label": "ชื่อ-สาขา", "type": "text" },
          { "id": "q3", "label": "ชื่อ-นามสกุล", "type": "text" },
          { "id": "q4", "label": "หน่วยงาน/บริษัท", "type": "text" },
          { "id": "q5", "label": "เงินเดือน (บาท) ", "type": "number" },
          {
              "id": "q6",
              "label": "งานที่ทำตรงกับสาขาที่เรียนหรือไม่",
              "type": "radio",
              "options": ["ใช่", "ไม่"]
          },{
              "id": "q7",
              "label": "งานทำในตลาดงานสำคัญหรือองค์กรที่มีชื่อเสียง",
              "type": "radio",
              "options": ["ใช่", "ไม่"]
          },{
              "id": "q8",
              "label": "งานที่ทำเกี่ยวข้องกับบริษัททางด้านระบบรางหรือไม่",
              "type": "radio",
              "options": ["ใช่", "ไม่"]
          },{
              "id": "q9",
              "label": "งานที่ทำเกี่ยวข้องกับบริษัททางด้านอากาศยานหรือไม่",
              "type": "radio",
              "options": ["ใช่", "ไม่"]
          },
      ]),
  },{
      "file": "7.1ก-6,7.1ก-7,7.1ก-36,7.1ก-38,7.1ก-42",
      "description": "ก-6 จำนวนนักศึกษาที่ได้รับรางวัลจากองค์กรภายนอก\nก-7 จำนวนรางวัลที่นักศึกษาได้รับจากองค์กรภายนอก\nก-36 โครงการที่นักศึกษาเข้าร่วมการแข่งขันด้านนวัตกรรมเพื่อสร้างนวัตกร\nก-38 จำนวนนักศึกษาระดับปริญญาตรีที่ได้รับรางวัลการแข่งขันทางวิชาชีพระดับชาติที่ตอบโจทย์สถานประกอบการ\nก-42 จำนวนนักศึกษาที่ได้รับรางวัลยกย่องชมเชย",
      "questions": JSON.stringify([
          { "id": "q1", "label": "ภาควิชา", "type": "text" },
          { "id": "q2", "label": "ชื่อ-นามสกุล", "type": "text" },
          { "id": "q3", "label": "รหัสนักศึกษา", "type": "text" },
          { "id": "q4", "label": "ชั้นปี", "type": "number" },
          { "id": "q5", "label": "ชื่อผลงาน", "type": "text" },
          { "id": "q6", "label": "ชื่อองค์กรภายนอก", "type": "text" },
          { "id": "q7", "label": "รางวัลที่ได้รับ", "type": "text" },
          { "id": "q8", "label": "วันเดือนปีทีได้รับรางวัล", "type": "date" },
          { "id": "q9", "label": "สถานที่จัดงาน", "type": "text" },
          { "id": "q10", "label": "หน่วยงานที่จัด", "type": "text" },
          {
              "id": "q11",
              "label": "โครงการที่นักศึกษาเข้าร่วมการแข่งขันด้านนวัตกรรมเพื่อสร้างนวัตกรใช่หรือไม่",
              "type": "radio",
              "options": ["ใช่", "ไม่"]
          },{
              "id": "q12",
              "label": "การแข่งขันทางวิชาชีพระดับชาติที่ตอบโจทย์สถานประกอบการใช่หรือไม่",
              "type": "radio",
              "options": ["ใช่", "ไม่"]
          },
          { "id": "q13", "label": "แนบรูปภาพประกอบ", "type": "file" },
      ]),
  },{
      "file": "7.1ก-37",
      "description": "ก-37 จำนวนนักศึกษาระดับปริญญาตรีที่นำเสนอผลงานในการประชุมวิชาการระดับชาติ",
      "questions": JSON.stringify([
          { "id": "q1", "label": "ภาควิชา", "type": "text" },
          { "id": "q2", "label": "ชื่อ-นามสกุล", "type": "text" },
          { "id": "q3", "label": "ชั้นปีที่", "type": "number" },
          { "id": "q4", "label": "รหัสนักศึกษา", "type": "text" },
          {
              "id": "q5",
              "label": "ประเภทผลงาน",
              "type": "radio",
              "options": ["ระดับชาติ", "ระดับนานาชาติ"]
          },
          {
              "id": "q6",
              "label": "ประเภทการตีพิมพ์",
              "type": "radio",
              "options": ["ตีพิมพ์ในวารสารวิชาการ (Journal)", "การเผยแพร่ผ่านรายงานสืบเนื่องการประชุมวิชาการ (Proceedings)"]
          },
          { "id": "q7", "label": "ชื่อผลงานตีพิมพ์", "type": "text" },
          { "id": "q8", "label": "จำนวนหน้า", "type": "number" },
          { "id": "q9", "label": "ชื่องานประชุมวิชาการหรือ ชื่อวารสาร", "type": "text" },
          {
          "id": "q10",
          "label": "",
          "type": "group",
          "children": [
            {
              "id": "q10_1",
              "label": "ผลงานสามารถตอบโจทย์ 10+2 อุตสาหกรรมเป้าหมายประเทศ",
              "type": "radio",
              "options": ["ใช่", "ไม่"]
            },
            { "id": "q10_2", "label": "อุตสาหกรรมยานยนต์สมัยใหม่", "type": "checkbox" },
            { "id": "q10_3", "label": "อุตสาหกรรมการแปรรูปอาหาร", "type": "checkbox" },
            { "id": "q10_4", "label": "อุตสาหกรรมอิเล็กทรอนิกส์อัจฉริยะ", "type": "checkbox" },
            { "id": "q10_5", "label": "อุตสาหกรรมหุ่นยนต์", "type": "checkbox" },
            { "id": "q10_6", "label": "อุตสาหกรรมการท่องเที่ยวกลุ่มรายได้ดีและการท่องเที่ยวเชิงสุขภา", "type": "checkbox" },
            { "id": "q10_7", "label": "อุตสาหกรรมการบินและโลจิสติกส์", "type": "checkbox" },
            { "id": "q10_8", "label": "อุตสาหกรรมเชื้อเพลิงชีวภาพและเคมีชีวภาพ", "type": "checkbox" },
            { "id": "q10_9", "label": "การเกษตรและเทคโนโลยีชีวภาพ", "type": "checkbox" },
            { "id": "q10_10", "label": "อุตสาหกรรมการแพทย์ครบวงจร", "type": "checkbox" },
            { "id": "q10_11", "label": "อุตสาหกรรมดิจิตอล", "type": "checkbox" },
            { "id": "q10_12", "label": "ระบบราง", "type": "checkbox" },
            { "id": "q10_13", "label": "อากาศยาน", "type": "checkbox" },
          ]
        },{
          "id": "q11",
          "label": "",
          "type": "group",
          "children": [
            {
              "id": "q11_1",
              "label": "ผลงานสามารถตอบโจทย์ 4+2 อุตสาหกรรมตามนโยบายใหม่ของรัฐบาล",
              "type": "radio",
              "options": ["ใช่", "ไม่"]
            },
            { "id": "q11_2", "label": "เซมิคอนดักเตอร์", "type": "checkbox" },
            { "id": "q11_3", "label": "ปัญญาประดิษฐ์ (AI)", "type": "checkbox" },
            { "id": "q11_4", "label": "Electric Vehicle (EV)", "type": "checkbox" },
            { "id": "q11_5", "label": "Clean Energy Transition", "type": "checkbox" },
            { "id": "q11_6", "label": "Advanced Medical Devices", "type": "checkbox" },
            { "id": "q11_7", "label": "Sustainable Resources & Environment", "type": "checkbox" },
          ]
        },
      ]),
  },{
      "file": "7.1ก-39",
      "description": "ก-39 จำนวนหลักสูตรที่จัดการเรียนการสอนร่วมกับสถานประกอบการ",
      "questions": JSON.stringify([
          { "id": "q1", "label": "ภาควิชา", "type": "text" },
          { "id": "q2", "label": "ชื่อหลักสูตร", "type": "text" },
          { "id": "q3", "label": "ชื่อสถานประกอบการ", "type": "text" },
          { "id": "q4", "label": "รายวิชาที่จัดร่วมกับสถานประกอบการ", "type": "text" },
          { "id": "q5", "label": "ชื่อกิจกรรมที่จัดร่วมกับสถานประกอบการ", "type": "text" },
      ]),
  },{
      "file": "7.1ก-40",
      "description": "ก-40 ร้อยละของผู้เข้าร่วมอบรมหลักสูตรระยะสั้นที่มีผลการประเมินผ่านเกณฑ์มาตรฐาน",
      "questions": JSON.stringify([
          { "id": "q1", "label": "ภาควิชา", "type": "text" },
          { "id": "q2", "label": "ชื่อหลักสูตรการอบรม", "type": "text" },
          { "id": "q3", "label": "ระยะเวลา", "type": "date" },
          { "id": "q4", "label": "จำนวนผู้เข้าร่วมอบรม", "type": "number" },
          { "id": "q5", "label": "จำนวนผู้เข้าผ่านประเมินเกณฑ์มาตรฐาน", "type": "number" },
      ]),
  },{
      "file": "7.1ก-43",
      "description": "ก-43 จำนวนหลักสูตรที่มีการใช้อาจารย์ประจำหลักสูตรร่วมกันระหว่างสาขา/ระหว่างคณะ",
      "questions": JSON.stringify([
          { "id": "q1", "label": "ภาควิชา", "type": "text" },
          { "id": "q2", "label": "ชื่อหลักสูตร", "type": "text" },
          { "id": "q3", "label": "ชื่ออาจารย์ประจำหลักสูตรร่วมกันระหว่างสาขา/ระหว่างคณะ", "type": "date" },
          { "id": "q4", "label": "สาขาวิชา", "type": "text" },
          { "id": "q5", "label": "ภาควิชา", "type": "text" },
          { "id": "q6", "label": "คณะ", "type": "text" },
          { "id": "q7", "label": "รายวิชา", "type": "text" },
      ]),
  },{
      "file": "7.1ก-41",
      "description": "ก-41 จำนวนนักศึกษาระดับ ป.ตรี ที่ได้รับรางวัลสหกิจศึกษาดีเด่น",
      "questions": JSON.stringify([
          { "id": "q1", "label": "ภาควิชา", "type": "text" },
          { "id": "q2", "label": "ชื่อ-นามสกุล", "type": "text" },
          { "id": "q3", "label": "รหัสนักศึกษา", "type": "text" },
          { "id": "q4", "label": "ชั้นปี", "type": "number" },
          { "id": "q5", "label": "ชื่อผลงาน", "type": "text" },
          { "id": "q6", "label": "ชื่อองค์กรภายนอก", "type": "text" },
          { "id": "q7", "label": "รางวัลที่ได้รับ", "type": "text" },
          { "id": "q8", "label": "วันเดือนปีทีได้รับรางวัล", "type": "date" },
          { "id": "q9", "label": "สถานที่จัดงาน", "type": "text" },
          { "id": "q10", "label": "หน่วยงานที่จัด", "type": "text" },
          { "id": "q11", "label": "แนบรูปภาพประกอบ", "type": "file" },
      ]),
  },{
      "file": "7.1ก-8",
      "description": "ก-8 จำนวนนักศึกษาที่ไปแลกเปลี่ยนต่างประเทศ",
      "questions": JSON.stringify([
          { "id": "q1", "label": "ภาควิชา", "type": "text" },
          { "id": "q2", "label": "ชื่อ-นามสกุล", "type": "text" },
          { "id": "q3", "label": "รหัสนักศึกษา", "type": "text" },
          { "id": "q4", "label": "ประเทศ", "type": "text" },
          { "id": "q5", "label": "ระยะเวลา", "type": "date-range" },
          { "id": "q6", "label": "ชื่อโครงการ", "type": "text" },
      ]),
  },{
      "file": "7.1ก-25",
      "description": "ก-25 นักศึกษาต่างชาติที่เดินทางมาแลกเปลี่ยนยัง มทร. ธัญบุรี (ระยะเวลามากกว่า 15 วัน)",
      "questions": JSON.stringify([
          { "id": "q1", "label": "ชื่อ-นามสกุล", "type": "text" },
          { "id": "q2", "label": "รหัสนักศึกษา", "type": "text" },
          { "id": "q3", "label": "ประเทศ", "type": "text" },
          { "id": "q4", "label": "ระยะเวลา", "type": "date-range" },
          { "id": "q5", "label": "ชื่อโครงการ", "type": "text" },
      ]),
  },{
      "file": "7.1ก-9",
      "description": "ก-9 นักศึกษามีสมรรถนะด้านดิจิทัลขั้นพื้นฐานตามมาตรฐานสากล IC3, ICDL, ComTiA หรือเทียบเท่าหรือสูงกว่า ",
      "questions": JSON.stringify([
          { "id": "q1", "label": "ภาควิชา", "type": "text" },
          { "id": "q2", "label": "ชื่อ-นามสกุล", "type": "text" },
          { "id": "q3", "label": "รหัสนักศึกษา", "type": "text" },
          { "id": "q4", "label": "ชื่อสมรรถนะ", "type": "text" },
          { "id": "q5", "label": "ครั้งที่สอบ", "type": "number" },
          {
              "id": "q6",
              "label": "ผลการสอบ",
              "type": "radio",
              "options": ["ผ่าน", "ไม่ผ่าน"]
          },
          { "id": "q7", "label": "วันเดือนปีที่ผ่านการสอบ", "type": "date" },
          { "id": "q8", "label": "แนบรูปผลการสอบ", "type": "file" },
      ]),
  },{
      "file": "7.1ก-53,7.1ก-54,7.1ก-61,7.1ก-62,7.1ก-63,7.1ข-12,7.1ข-13,7.3ก-3,7.3ก-5,7.3ก-6,7.3ก-7,7.3ก-8,7.5ก-27,7.5ก-28",
      "description": "7.1ก-53 ร้อยละงานวิจัยที่ตอบโจทย์ 10+2 อุตสาหกรรมเป้าหมายฯ\n7.1ก-54 ร้อยละงานวิจัยที่ตอบโจทย์ 4+2 อุตสาหกรรมตามนโยบายใหม่ของรัฐบาล\n7.1ก-61 จำนวนผลงานวิจัยด้านระบบขนส่งทางราง\n7.1ก-62 จำนวนผลงานวิจัยด้านอากาศยาน\n7.1ก-63 จำนวนผลงานวิจัยด้านยานยนต์ไฟฟ้า\n7.1ข-12 จำนวนนวัตกรรมที่สามารถตอบโจทย์ 10+2 อุตสาหกรรมเป้าหมาย\n7.1ข-13 จำนวนนวัตกรรมที่สามารถตอบโจทย์ 4+2 อุตสาหกรรมตามนโยบายใหม่ของรัฐบาล\n7.3ก-3 ร้อยละของอาจารย์ที่มีผลงานวิจัยตีพิมพ์ระดับนานาชาติ\n7.3ก-5 ร้อยละของงานวิจัยตีพิมพ์ในวารสารระดับนานาชาติต่อจำนวนอาจารย์\n7.3ก-6 จำนวนบทความวิจัยผลงานวิชาการตีพิมพ์ด้านระบบราง\n7.3ก-7 จำนวนบทความวิจัยผลงานวิชาการตีพิมพ์ด้านอากาศยาน\n7.3ก-8 จำนวนบทความวิจัยผลงานวิชาการตีพิมพ์ด้านยานยนต์ไฟฟ้า\n7.5ก-27 ต้นทุนเฉลี่ยของงานวิจัยต่อชิ้นงานตีพิมพ์เผยแพร่งานวิจัยในระดับประเทศ\n7.5ก-28 ต้นทุนเฉลี่ยของงานวิจัยต่อชิ้นงานตีพิมพ์เผยแพร่งานวิจัยในระดับนานาชาติ",
      "questions": JSON.stringify([
          { "id": "q1", "label": "หน่วยงาน", "type": "text" },
          { "id": "q2", "label": "ชื่อนักวิจัย", "type": "text" },
          { "id": "q3", "label": "ชื่อผลงาน", "type": "text" },
          {
            "id": "q10",
            "label": "งานวิจัยที่นำไปใช้ประโยชน์สามารถตอบโจทย์ 10+2 อุตสาหกรรมเป้าหมายประเทศ",
            "type": "group",
            "children": [
              { "id": "q10_2", "label": "อุตสาหกรรมยานยนต์สมัยใหม่", "type": "checkbox" },
              { "id": "q10_3", "label": "อุตสาหกรรมการแปรรูปอาหาร", "type": "checkbox" },
              { "id": "q10_4", "label": "อุตสาหกรรมอิเล็กทรอนิกส์อัจฉริยะ", "type": "checkbox" },
              { "id": "q10_5", "label": "อุตสาหกรรมหุ่นยนต์", "type": "checkbox" },
              { "id": "q10_6", "label": "อุตสาหกรรมการท่องเที่ยวกลุ่มรายได้ดีและการท่องเที่ยวเชิงสุขภา", "type": "checkbox" },
              { "id": "q10_7", "label": "อุตสาหกรรมการบินและโลจิสติกส์", "type": "checkbox" },
              { "id": "q10_8", "label": "อุตสาหกรรมเชื้อเพลิงชีวภาพและเคมีชีวภาพ", "type": "checkbox" },
              { "id": "q10_9", "label": "การเกษตรและเทคโนโลยีชีวภาพ", "type": "checkbox" },
              { "id": "q10_10", "label": "อุตสาหกรรมการแพทย์ครบวงจร", "type": "checkbox" },
              { "id": "q10_11", "label": "อุตสาหกรรมดิจิตอล", "type": "checkbox" },
              { "id": "q10_12", "label": "ระบบราง", "type": "checkbox" },
              { "id": "q10_13", "label": "อากาศยาน", "type": "checkbox" },
            ]
          },{
          "id": "q11",
          "label": "งานวิจัยที่นำไปใช้ประโยชน์สามารถตอบโจทย์ 4+2 อุตสาหกรรมเป้าหมายประเทศ",
          "type": "group",
          "children": [
            { "id": "q11_2", "label": "เซมิคอนดักเตอร์", "type": "checkbox" },
            { "id": "q11_3", "label": "ปัญญาประดิษฐ์ (AI)", "type": "checkbox" },
            { "id": "q11_4", "label": "Electric Vehicle (EV)", "type": "checkbox" },
            { "id": "q11_5", "label": "Clean Energy Transition", "type": "checkbox" },
            { "id": "q11_6", "label": "Advanced Medical Devices", "type": "checkbox" },
            { "id": "q11_7", "label": "Sustainable Resources & Environment", "type": "checkbox" },
          ]
        }
      ]),
  },{
      "file": "7.3ก-40",
      "description": "7.3ก-40 รับรางวัลประกาศเกียรติคุณ",
      "questions": JSON.stringify([
          { "id": "q1", "label": "ภาควิชา", "type": "text" },
          { "id": "q2", "label": "คำนำหน้าชื่อ", "type": "text" },
          { "id": "q3", "label": "ชื่อ-นามสกุล", "type": "text" },
          {
          "id": "q4",
          "label": "รับรางวัลประกาศเกียรติคุณ  (รางวัลเกียรติยศ บุคคลแห่งปี เป็นการมอบครั้งแรกเพื่อเป็นเกียรติคุณให้กำลังใจแก่บุคคลที่ได้เสียสละและมุ่งมั่นทำประโยชน์",
          "type": "group",
          "children": [
            { "id": "q4_2", "label": "ชื่อรางวัล", "type": "text" },
            { "id": "q4_3", "label": "ผู้จัดให้รางวัล", "type": "text" },
            { "id": "q4_4", "label": "สถานที่", "type": "text" },
            { "id": "q4_5", "label": "หลักฐาน", "type": "file" },
          ]
        }
      ]),
  },{
      "file": "7.3ก-35,7.3ก-9,7.3ก-32,7.3ก-36,7.3ก-39",
      "description": "7.3ก-9  ความเขี่ยวชาญเฉพาะด้านเกี่ยวกับอุตสาหกรรมเป้าหมายของประเทศ\n7.3ก-32 ชื่ออบรมทักษะความรู้สมัยใหม่ในศตวรรษที่ 21\n7.3ก-33 จำนวนบุคลากรที่ได้รับการอบรมหลักสูตรผู้บริหาร\n7.3ก-34 ร้อยละของบุคลากรที่ได้รับการพัฒนาทักษะความรู้สมัยใหม่ในศตวรรษที่ 21\n7.3ก-35 ทักษะความรู้อุตสาหกรรมใหม่ 4+2 New S-Curve เพื่ออุตสาหกรรมมุ่งเป้าแห่งอนาคต (เกษตรสมัยใหม่และเทคโนโลยีชีวภาพ)\n7.3ก-36 ร้อยละของบุคลากรสายวิชาการที่ผ่านการอบรมหลักสูตรเฉพาะทาง/มาตรฐาน ในระดับประเทศหรือนานาชาติ\n7.3ก-39 จำนวนบุคลากรสายสนับสนุนที่เข้าร่วมการฝึกอบรมและนำเสนอผลงานด้านเทคโนโลยีการบริหารจัดการ",
      "questions": JSON.stringify([
          {
            "id": "q1",
            "label": "บุคลากร",
            "type": "radio",
            "options": ["สายวิชาการ", "สายสนับสนุน"]
          },
          { "id": "q2", "label": "ชื่อ-นามสกุล", "type": "text" },
          {
            "id": "q3",
            "label": "การอบรม",
            "type": "radio",
            "options": ["การพัฒนาตามสาขาวิชาชีพ", "การพัฒนาคุณภาพการเรียนการสอน","การวิจัยเพื่อสร้างสรรค์นวัตกรรม","การบริการวิชาการและเพิ่มคุณค่า","การพัฒนาทักษะเชิงบริหารจัดการ","7.3ก-33 บุคลากรที่ได้รับการอบรมหลักสูตรผู้บริหาร","7.3ก-39 บุคลากรสายสนับสนุนที่เข้าร่วมการฝึกอบรมและนำเสนอผลงานด้านเทคโนโลยีการบริหารจัดการ"]
          },
          {
            "id": "q4",
            "label": "อบรมทักษะความรู้สมัยใหม่",
            "type": "group",
            "children": [
              { "id": "q4_1", "label": "7.3ก-34 อบรมทักษะความรู้สมัยใหม่ในศตวรรษที่ 21 ทักษะด้านความรู้ Hard Skills ", "type": "checkbox" },
              { "id": "q4_2", "label": "7.3ก-34 อบรมทักษะความรู้สมัยใหม่ในศตวรรษที่ 21 ทักษะทางอารมณ์ Soft Skills ", "type": "checkbox" },
              { "id": "q4_3", "label": "7.3ก-36 ชื่ออบรมหลักสูตรเฉพาะทาง/ มาตรฐานในระดับประเทศหรือนานาชาติ ", "type": "checkbox" },
            ]
          },
          {
              "id": "q5",
              "label": "7.3ก-9 บุคลากรที่ได้รับการพัฒนาความเชี่ยวชาญเฉพาะด้านเกี่ยวกับอุตสาหกรรมเป้าหมายของประเทศ",
              "type": "group",
              "children": [
                { "id": "q5_1", "label": "อุตสาหกรรมยานยนต์สมัยใหม่", "type": "checkbox" },
                { "id": "q5_2", "label": "อุตสาหกรรมการแปรรูปอาหาร", "type": "checkbox" },
                { "id": "q5_3", "label": "อุตสาหกรรมอิเล็กทรอนิกส์อัจฉริยะ", "type": "checkbox" },
                { "id": "q5_4", "label": "อุตสาหกรรมหุ่นยนต์", "type": "checkbox" },
                { "id": "q5_5", "label": "อุตสาหกรรมการท่องเที่ยวกลุ่มรายได้ดีและการท่องเที่ยวเชิงสุขภา", "type": "checkbox" },
                { "id": "q5_6", "label": "อุตสาหกรรมการบินและโลจิสติกส์", "type": "checkbox" },
                { "id": "q5_7", "label": "อุตสาหกรรมเชื้อเพลิงชีวภาพและเคมีชีวภาพ", "type": "checkbox" },
                { "id": "q5_8", "label": "การเกษตรและเทคโนโลยีชีวภาพ", "type": "checkbox" },
                { "id": "q5_9", "label": "อุตสาหกรรมการแพทย์ครบวงจร", "type": "checkbox" },
                { "id": "q5_10", "label": "อุตสาหกรรมดิจิตอล", "type": "checkbox" },
                { "id": "q5_11", "label": "ระบบราง", "type": "checkbox" },
                { "id": "q5_12", "label": "อากาศยาน", "type": "checkbox" },
              ]
            },
            {
              "id": "q6",
              "label": "7.3ก-35 ทักษะความรู้อุตสาหกรรมใหม่ 4+2 New S-Curve เพื่ออุตสาหกรรมมุ่งเป้าแห่งอนาคต (เกษตรสมัยใหม่และเทคโนโลยีชีวภาพ)",
              "type": "group",
              "children": [
                { "id": "q6_1", "label": "เซมิคอนดักเตอร์", "type": "checkbox" },
                { "id": "q6_2", "label": "ปัญญาประดิษฐ์ (AI)", "type": "checkbox" },
                { "id": "q6_3", "label": "Electric Vehicle (EV)", "type": "checkbox" },
                { "id": "q6_4", "label": "Clean Energy Transition", "type": "checkbox" },
                { "id": "q6_5", "label": "Advanced Medical Devices", "type": "checkbox" },
                { "id": "q6_6", "label": "Sustainable Resources & Environment", "type": "checkbox" },
              ]
            },
          
      ]),
  },{
      "file": "7.1ก-45",
      "description": "7.1ก-45 จำนวนสิทธิบัตรและอนุสิทธิบัตร",
      "questions": JSON.stringify([
          { "id": "q1", "label": "ชื่อผลงาน", "type": "text" },
          { "id": "q2", "label": "ชื่อผู้ออกแบบ", "type": "text" },
          {
            "id": "q3",
            "label": "ประเภทสิทธิบัตร",
            "type": "radio",
            "options": ["สิทธิบัตรสิทธิบัตรการประดิษฐ์", "สิทธิบัตรการออกแบบผลิตภัณฑ์","อนุสิทธิบัตร"]
          },
          { "id": "q4", "label": "เลขที่คำขอ", "type": "text" },
          { "id": "q5", "label": "วันที่ยื่นคำขอ", "type": "date" },
          { "id": "q6", "label": "เลขที่สิทธิบัตร/อนุสิทธิบัตร", "type": "text" },
          { "id": "q7", "label": "วันที่ได้รับ", "type": "text" },
          { "id": "q8", "label": "เดือน", "type": "text" },
          { "id": "q9", "label": "ปี พ.ศ.", "type": "text" },
          {
            "id": "q10",
            "label": "ระดับคุณภาพผลงานทางวิชาการ",
            "type": "radio",
            "options": ["0.4", "1.0"]
          },
          { "id": "q11", "label": "ภาควิชา", "type": "text" },
          {
            "id": "q12",
            "label": "ประเภท",
            "type": "radio",
            "options": ["ยื่นคำขอ", "ได้รับการจดทะเบียน"]
          },
      ]),
  },{
      "file": "แบบประเมินความพึงพอใจต่อการดำเนินงานด้านเทคโนโลยีสารสนเทศ",
      "description": "ความพึงพอใจในการใช้บริหารจัดการระบบฐานข้อมูลสารสนเทศ",
      "questions": JSON.stringify([
          { "id": "q0", "label": "", "type": "label", "value" : "คำชี้แจง \nโปรดทำเครื่องหมาย ลงในช่องระดับความพึงพอใจของท่านในแต่ละข้อ ซึ่งมีเกณฑ์การให้คะแนนตามระดับความพึงพอใจดังนี้\n5   หมายถึง   ดีมาก\n4   หมายถึง   ดี\n3   หมายถึง   ปานกลาง\n2   หมายถึง   พอใช้\n1   หมายถึง   ควรปรับปรุง" },
          {
            "id": "q1",
            "label": "ความรวดเร็วในการให้บริการ",
            "type": "radio",
            "options": ["1", "2","3","4","5"]
          },{
            "id": "q2",
            "label": "ความถูกต้องของข้อมูลที่ให้บริการ",
            "type": "radio",
            "options": ["1", "2","3","4","5"]
          },{
            "id": "q3",
            "label": "ความสามารถในการแก้ไขปัญหา",
            "type": "radio",
            "options": ["1", "2","3","4","5"]
          },{
            "id": "q4",
            "label": "ความสุภาพและมีมารยาทของเจ้าหน้าที่",
            "type": "radio",
            "options": ["1", "2","3","4","5"]
          },{
            "id": "q5",
            "label": "ความพร้อมใช้งานของระบบสารสนเทศ",
            "type": "radio",
            "options": ["1", "2","3","4","5"]
          },{
            "id": "q6",
            "label": "ความปลอดภัยของระบบ",
            "type": "radio",
            "options": ["1", "2","3","4","5"]
          },{
            "id": "q7",
            "label": "การอัปเดตเทคโนโลยีให้ทันสมัย",
            "type": "radio",
            "options": ["1", "2","3","4","5"]
          },{
            "id": "q8",
            "label": "ความพึงพอใจโดยรวมต่อฝ่าย IT",
            "type": "radio",
            "options": ["1", "2","3","4","5"]
          },
          { "id": "q9", "label": "ข้อเสนอแนะเพิ่มเติม(ถ้ามี)", "type": "text" },
      ]),
  },{
      "file": "แบบสอบถาม ในหมวดที่ 1 และหมวดที่ 5",
      "description": "เพื่อนำไปพัฒนาตามเกณฑ์ EdPEx ประจำปีการศึกษา 2567 ในระดับคณะฯ",
      "questions": JSON.stringify([
          { "id": "q1", "label": "", "type": "label" ,"value" : "หมวด 1 ความเชื่อมั่นต่อการบริหารงานงานของผู้บริหารตามหลักธรรมาภิบาลการรับรู้ การสื่อสารและความพึงพอใจต่อการสื่อสารทิศทางของผู้นำองค์กรของผู้นำระดับสูง โดยแบ่งการประเมินจำนวน 6 ชุด ดังนี้"},
          { "id": "q2", "label": "1.แบบประเมินผู้นำองค์กร (คณบดี)", "type": "link" , "value" : "https://forms.office.com/r/paqjJY0dpB" },
          { "id": "q3", "label": "2.แบบประเมินผู้นำองค์กร (รองคณบดี)", "type": "link" , "value" : "https://forms.office.com/r/nhkEqF3AML" },
          { "id": "q4", "label": "3.แบบประเมินผู้นำองค์กร (หัวหน้าสำนักงานคณบดี)", "type": "link" , "value" : "https://forms.office.com/r/xBiSVk5pAn" },
          { "id": "q5", "label": "4.แบบประเมินผู้นำองค์กร (หัวหน้าภาควิชาคณะวิศวกรรมศาสตร์)", "type": "link" , "value" : "https://forms.office.com/r/pPutyjwgjb" },
          { "id": "q6", "label": "5.แบบประเมินผู้นำองค์กร (หัวหน้าฝ่ายประจำคณะวิศวกรรมศาสตร์)", "type": "link" , "value" : "https://forms.office.com/r/vn7wxhuR1v" },
          { "id": "q7", "label": "6.แบบสอบถามความเข้าใจวิสัยทัศน์ ค่านิยม วัฒนธรรม และการนำไปใช้ประโยชน์ในการปฏิบัติงานของบุคลากรทุกคนในคณะวิศวกรรมศาสตร์", "type": "link" , "value" : "https://forms.office.com/r/URn8Pg89AK" },
          { "id": "q8", "label": "", "type": "label" ,"value" : "หมวดที่ 5 ความผูกพันขององค์กร"},
          { "id": "q9", "label": "7.แบบสอบถามความผูกพันของบุคลากรสายวิชาการและสายสนับสนุน", "type": "link" , "value" : "https://forms.office.com/r/fJiNtZ9Bjg" }
      ]),
  },{
      "file": "แบบประเมินความพึงพอใจต่อการดำเนินงานของงานอาคาร",
      "description": "",
      "questions": JSON.stringify([
           { "id": "q0", "label": "", "type": "label" ,"value" : "หมายเหตุ: แบบสอบถามนี้ไม่ระบุตัวตน และข้อมูลของท่านจะถูกใช้เพื่อการวิเคราะห์ในภาพรวมเท่านั้น"},
           {
            "id": "q1",
            "label": "บุคลากร",
            "type": "radio",
            "options": ["สายวิชาการ", "สายสนับสนุน"]
          },{
            "id": "q2",
            "label": "7.1ข-20 ท่านเคยผ่านการอบรมมาตรฐานความปลอดภัยหรือไม่",
            "type": "radio",
            "options": ["เคย", "ไม่เคย"]
          },{
            "id": "q3",
            "label": "7.1ข-21 โปรดระบุระดับความพึงพอใจของท่านต่อมาตรฐานความปลอดภัยของห้องปฏิบัติการ (ระดับความพึงพอใจ)\nระดับความพึงพอใจ\n5 หมายถึง มีความพึงพอใจมากที่สุด\n4 หมายถึง มีความพึงพอใจมาก\n3 หมายถึง มีความพึงพอใจปานกลาง\n2 หมายถึง มีความพึงพอใจน้อย\n1 หมายถึง มีความพึงพอใจน้อยที่สุด",
            "type": "radio",
            "options": ["1", "2","3","4","5"]
          },{
            "id": "q4",
            "label": "7.1ข-22 โปรดระบุระดับความไม่พึงพอใจของท่านต่อมาตรฐานความปลอดภัยของห้องปฏิบัติการ (ระดับความไม่พึงพอใจ)\nระดับความไม่พึงพอใจ\n5 หมายถึง มีความไม่พึงพอใจมากที่สุด\n4 หมายถึง มีความไม่พึงพอใจมาก\n3 หมายถึง มีความไม่พึงพอใจปานกลาง\n2 หมายถึง มีความไม่พึงพอใจน้อย\n1 หมายถึง มีความไม่พึงพอใจน้อยที่สุด",
            "type": "radio",
            "options": ["1", "2","3","4","5"]
          },{
            "id": "q5",
            "label": "7.1ข-23 โปรดระบุระดับความเชื่อมั่นของท่านต่อมาตรฐานความปลอดภัยของห้องปฏิบัติการ (ระดับความเชื่อมั่น)\nระดับความเชื่อมั่น\n5 หมายถึง มีความเชื่อมั่นมากที่สุด\n4 หมายถึง มีความเชื่อมั่นพอใจมาก\n3 หมายถึง มีความเชื่อมั่นปานกลาง\n2 หมายถึง มีความเชื่อมั่นน้อย\n1 หมายถึง มีความเชื่อมั่นน้อยที่สุด",
            "type": "radio",
            "options": ["1", "2","3","4","5"]
          },{
            "id": "q6",
            "label": "7.3ก-17 โปรดระบุระดับความพึงพอใจของท่านต่อความปลอดภัยของคณะฯ  (ระดับความพึงพอใจ)\nระดับความพึงพอใจ\n5 หมายถึง มีความพึงพอใจมากที่สุด\n4 หมายถึง มีความพึงพอใจมาก\n3 หมายถึง มีความพึงพอใจปานกลาง\n2 หมายถึง มีความพึงพอใจน้อย\n1 หมายถึง มีความพึงพอใจน้อยที่สุด",
            "type": "radio",
            "options": ["1", "2","3","4","5"]
          },{
            "id": "q7",
            "label": "7.3ก-21 โปรดระบุระดับความไม่พึงพอใจของท่านต่อความปลอดภัยของคณะฯ  (ระดับความไม่พึงพอใจ) \nระดับความไม่พึงพอใจ\n5 หมายถึง มีความไม่พึงพอใจมากที่สุด\n4 หมายถึง มีความไม่พึงพอใจมาก\n3 หมายถึง มีความไม่พึงพอใจปานกลาง\n2 หมายถึง มีความไม่พึงพอใจน้อย\n1 หมายถึง มีความไม่พึงพอใจน้อยที่สุด",
            "type": "radio",
            "options": ["1", "2","3","4","5"]
          },
          
      ]),
  },{
      "file": "7.3ก-3,7.3ก-5,7.3ก-6,7.3ก-7,7.3ก-8,7.5ก-27,7.5ก-28",
      "description": "7.3ก-3	ร้อยละของอาจารย์ที่มีผลงานวิจัยตีพิมพ์ระดับนานาชาติ \n7.3ก-5ร้อยละของงานวิจัยตีพิมพ์ในวารสารระดับนานาชาติต่อจำนวนอาจารย์ \n7.3ก-6	จำนวนบทความวิจัยผลงานวิชาการตีพิมพ์ด้านระบบราง\n7.3ก-7	จำนวนบทความวิจัยผลงานวิชาการตีพิมพ์ด้านอากาศยาน\n7.3ก-8	จำนวนบทความวิจัยผลงานวิชาการตีพิมพ์ด้านยานยนต์ไฟฟ้า\n7.5ก-27	ต้นทุนเฉลี่ยของงานวิจัยต่อชิ้นงานตีพิมพ์เผยแพร่งานวิจัยในระดับประเทศ\n7.5ก-28	ต้นทุนเฉลี่ยของงานวิจัยต่อชิ้นงานตีพิมพ์เผยแพร่งานวิจัยในระดับนานาชาติ",
      "questions": JSON.stringify([
           { "id": "q1", "label": "ภาควิชา", "type": "text"},
           { "id": "q2", "label": "ชื่อนักวิจัย", "type": "text"},
           { "id": "q3", "label": "ชื่อผลงาน", "type": "text"},
           {
              "id": "q4",
              "label": "บทความได้รับ",
              "type": "radio",
              "options": ["Scopus", "International proceeding"]
            },
            { "id": "q5", "label": "ระดับ (TCI1, Q1,..,Q4)", "type": "text"},
            { "id": "q6", "label": "ชื่อบทความ", "type": "text"},
            { "id": "q7", "label": "ชื่อผู้จัดหรือสำนักพิมพ์วารสาร", "type": "text"},
            { "id": "q8", "label": "ต้นทุนเฉลี่ยของงานวิจัยต่อชิ้นงานตีพิมพ์", "type": "text"},
            {
              "id": "q9",
              "label": "ผลงานตีพิมพ์ในระดับนานาชาติสามารถตอบโจทย์ 10+2 อุตสาหกรรมเป้าหมายประเทศ",
              "type": "group",
              "children": [
                { "id": "q9_1", "label": "อุตสาหกรรมยานยนต์สมัยใหม่", "type": "checkbox" },
                { "id": "q9_2", "label": "อุตสาหกรรมการแปรรูปอาหาร", "type": "checkbox" },
                { "id": "q9_3", "label": "อุตสาหกรรมอิเล็กทรอนิกส์อัจฉริยะ", "type": "checkbox" },
                { "id": "q9_4", "label": "อุตสาหกรรมหุ่นยนต์", "type": "checkbox" },
                { "id": "q9_5", "label": "อุตสาหกรรมการท่องเที่ยวกลุ่มรายได้ดีและการท่องเที่ยวเชิงสุขภา", "type": "checkbox" },
                { "id": "q9_6", "label": "อุตสาหกรรมการบินและโลจิสติกส์", "type": "checkbox" },
                { "id": "q9_7", "label": "อุตสาหกรรมเชื้อเพลิงชีวภาพและเคมีชีวภาพ", "type": "checkbox" },
                { "id": "q9_8", "label": "การเกษตรและเทคโนโลยีชีวภาพ", "type": "checkbox" },
                { "id": "q9_9", "label": "อุตสาหกรรมการแพทย์ครบวงจร", "type": "checkbox" },
                { "id": "q9_10", "label": "อุตสาหกรรมดิจิตอล", "type": "checkbox" },
                { "id": "q9_11", "label": "ระบบราง", "type": "checkbox" },
                { "id": "q9_12", "label": "อากาศยาน", "type": "checkbox" },
              ]
            },
            {
              "id": "q10",
              "label": "ผลงานตีพิมพ์ในระดับนานาชาติสามารถตอบโจทย์ 4+2 อุตสาหกรรมตามนโยบายใหม่ของรัฐบาล",
              "type": "group",
              "children": [
                { "id": "q10_1", "label": "เซมิคอนดักเตอร์", "type": "checkbox" },
                { "id": "q10_2", "label": "ปัญญาประดิษฐ์ (AI)", "type": "checkbox" },
                { "id": "q10_3", "label": "Electric Vehicle (EV)", "type": "checkbox" },
                { "id": "q10_4", "label": "Clean Energy Transition", "type": "checkbox" },
                { "id": "q10_5", "label": "Advanced Medical Devices", "type": "checkbox" },
                { "id": "q10_6", "label": "Sustainable Resources & Environment", "type": "checkbox" },
              ]
            },
      ]),
  }






  ];

  for (const form of forms) {
    await prisma.form.upsert({
      where: { file: form.file },
      update: {
        description: form.description,
        method: form.method ?? undefined, // เพิ่มเฉพาะเมื่อมี field นี้
        questions: form.questions,
      },
      create: form,
    });
  }

  const invites = [
    { email: "mathika.m@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_สำนักงานคณบดี" },
    { email: "Tippawan.b@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "งานบุคลากร" },
    { email: "panatda.e@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_งานบุคลากร" },
    { email: "natee.s@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_ฝ่ายพัฒนานักศึกษา" },
    { email: "therakanya.s@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ฝ่ายพัฒนานักศึกษา" },
    { email: "nucharin.f@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ฝ่ายพัฒนานักศึกษา" },
    { email: "kullachat.k@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ฝ่ายวิชาการ" },
    { email: "chadchadaporn.p@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_ฝ่ายวิชาการ" },
    { email: "prangthong.o@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_ฝ่ายวิจัยพัฒนาและบริการวิชาการ" },
    { email: "pitchaya.w@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ฝ่ายวิจัยพัฒนาและบริการวิชาการ" },
    { email: "pipat.p@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_งานประกันคุณภาพการศึกษา" },
    { email: "duangduen.s@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_งานประกันคุณภาพการศึกษา" },
    { email: "amornrat.k@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_งานประกันคุณภาพการศึกษา" },
    { email: "sukhom.l@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ภาควิชาวิศวกรรมโยธา" },
    { email: "jatuphon.t@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_ภาควิชาวิศวกรรมโยธา" },
    { email: "sasiradee.j@en. rmut.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_ภาควิชาวิศวกรรมเคมี" },
    { email: "la-ongthip.y@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ภาควิชาวิศวกรรมเคมี" },
    { email: "paitoon.r@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_ภาควิชาวิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม" },
    { email: "thanakorn.s@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ภาควิชาวิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม" },
    { email: "kawita.c@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_ภาควิชาวิศวกรรมวัสดุและโลหการ" },
    { email: "phornwalan.n@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ภาควิชาวิศวกรรมวัสดุและโลหการ" },
    { email: "manop.y@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_ภาควิชาวิศวกรรมเครื่องกล" },
    { email: "manusak.t@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ภาควิชาวิศวกรรมเครื่องกล" },
    { email: "saowaluk.t@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ภาควิชาวิศวกรรมเครื่องกล" },
    { email: "sirichai.t@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_ภาควิชาวิศวกรรมคอมพิวเตอร์" },
    { email: "pauline.k@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ภาควิชาวิศวกรรมคอมพิวเตอร์" },
    { email: "nitikorn.j@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_ภาควิชาวิศวกรรมไฟฟ้า" },
    { email: "krit.k@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ภาควิชาวิศวกรรมไฟฟ้า" },
    { email: "nitikorn.j@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ภาควิชาวิศวกรรมไฟฟ้า" },
    { email: "porakoch.s@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_ภาควิชาวิศวกรรมอุตสาหการ" },
    { email: "chawalit.i@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ภาควิชาวิศวกรรมอุตสาหการ" },
    { email: "chonticha.p@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ภาควิชาวิศวกรรมอุตสาหการ" },
    { email: "areeya.t@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_ภาควิชาวิศวกรรมสิ่งทอ" },
    { email: "phansupa.c@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ภาควิชาวิศวกรรมสิ่งทอ" },
    { email: "jaturong@exchange.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_ภาควิชาวิศวกรรมเกษตร" },
    { email: "grianggai.s@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ภาควิชาวิศวกรรมเกษตร" },
    { email: "Prueksa.s@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_ภาควิชาวิศวกรรมเกษตร" },
    { email: "kirana.s@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ภาควิชาวิศวกรรมเกษตร" },
    { email: "sukunya_w@rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "ภาควิชาวิศวกรรมเกษตร" },
    { email: "Pitchayapatchaya.s@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "งานแผนและงบประมาณ" },
    { email: "laddawan.s@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "reviewer_งานแผนและงบประมาณ" },
    { email: "panrawee.r@en.rmutt.ac.th", used: false, invitedAt: new Date(), roleName: "admin" },
  ];
  
  
  const roleMap = new Map<string, number>();
  const allRoles = await prisma.role.findMany();
  allRoles.forEach(role => roleMap.set(role.name, role.id));

  for (const invite of invites) {
    const roleId = roleMap.get(invite.roleName);
    if (!roleId) {
      console.warn(`❌ ไม่พบ role: ${invite.roleName}`);
      continue;
    }

    await prisma.invite.upsert({
      where: { email: invite.email },
      update: {},
      create: {
        email: invite.email,
        roleId,
        used: invite.used,
        invitedAt: invite.invitedAt,
      },
    });
  }

  // ✅ กำหนดให้ Users กรอกฟอร์มได้ (ใช้ userId แทน roleId)
  // const formKR1 = await prisma.form.findUnique({ where: { file: "KR1" } });
  // const formKR2 = await prisma.form.findUnique({ where: { file: "KR2" } });

  // if (formKR1 && formKR2) {
  //   await prisma.formAccess.createMany({
  //     data: [
  //       { roleId: userA.id, formId: formKR1.id }, // user_a สามารถเข้าถึง KR1
  //       { roleId: userB.id, formId: formKR2.id }, // user_b สามารถเข้าถึง KR2
  //       { roleId: reviewer1.id, formId: formKR1.id }, // reviewer1 ตรวจสอบ KR1 ได้
  //     ],
  //   });
  // }

  console.log("✅ Database Seeded!");
}

main()
  .catch((e) => {
    console.error(e);
    process.exit(1);
  })
  .finally(async () => {
    await prisma.$disconnect();
  });
